GopalSaraf/Practicals/PSDL/include/proc/pic18f25k83.inc
// Register: RXF15SIDL
#define RXF15SIDL RXF15SIDL
RXF15SIDL                                equ 0372Dh
// bitfield definitions
RXF15SIDL_EID16_POSN                     equ 0000h
RXF15SIDL_EID16_POSITION                 equ 0000h
RXF15SIDL_EID16_SIZE                     equ 0001h
RXF15SIDL_EID16_LENGTH                   equ 0001h
RXF15SIDL_EID16_MASK                     equ 0001h
RXF15SIDL_EID17_POSN                     equ 0001h
RXF15SIDL_EID17_POSITION                 equ 0001h
RXF15SIDL_EID17_SIZE                     equ 0001h
RXF15SIDL_EID17_LENGTH                   equ 0001h
RXF15SIDL_EID17_MASK                     equ 0002h
RXF15SIDL_EXIDEN_POSN                    equ 0003h
RXF15SIDL_EXIDEN_POSITION                equ 0003h
RXF15SIDL_EXIDEN_SIZE                    equ 0001h
RXF15SIDL_EXIDEN_LENGTH                  equ 0001h
RXF15SIDL_EXIDEN_MASK                    equ 0008h
RXF15SIDL_SID0_POSN                      equ 0005h
RXF15SIDL_SID0_POSITION                  equ 0005h
RXF15SIDL_SID0_SIZE                      equ 0001h
RXF15SIDL_SID0_LENGTH                    equ 0001h
RXF15SIDL_SID0_MASK                      equ 0020h
RXF15SIDL_SID1_POSN                      equ 0006h
RXF15SIDL_SID1_POSITION                  equ 0006h
RXF15SIDL_SID1_SIZE                      equ 0001h
RXF15SIDL_SID1_LENGTH                    equ 0001h
RXF15SIDL_SID1_MASK                      equ 0040h
RXF15SIDL_SID2_POSN                      equ 0007h
RXF15SIDL_SID2_POSITION                  equ 0007h
RXF15SIDL_SID2_SIZE                      equ 0001h
RXF15SIDL_SID2_LENGTH                    equ 0001h
RXF15SIDL_SID2_MASK                      equ 0080h
RXF15SIDL_EID18_POSN                     equ 0005h
RXF15SIDL_EID18_POSITION                 equ 0005h
RXF15SIDL_EID18_SIZE                     equ 0001h
RXF15SIDL_EID18_LENGTH                   equ 0001h
RXF15SIDL_EID18_MASK                     equ 0020h
RXF15SIDL_EID19_POSN                     equ 0006h
RXF15SIDL_EID19_POSITION                 equ 0006h
RXF15SIDL_EID19_SIZE                     equ 0001h
RXF15SIDL_EID19_LENGTH                   equ 0001h
RXF15SIDL_EID19_MASK                     equ 0040h
RXF15SIDL_EID20_POSN                     equ 0007h
RXF15SIDL_EID20_POSITION                 equ 0007h
RXF15SIDL_EID20_SIZE                     equ 0001h
RXF15SIDL_EID20_LENGTH                   equ 0001h
RXF15SIDL_EID20_MASK                     equ 0080h
RXF15SIDL_EID_POSN                       equ 0000h
RXF15SIDL_EID_POSITION                   equ 0000h
RXF15SIDL_EID_SIZE                       equ 0002h
RXF15SIDL_EID_LENGTH                     equ 0002h
RXF15SIDL_EID_MASK                       equ 0003h
RXF15SIDL_SID_POSN                       equ 0005h
RXF15SIDL_SID_POSITION                   equ 0005h
RXF15SIDL_SID_SIZE                       equ 0003h
RXF15SIDL_SID_LENGTH                     equ 0003h
RXF15SIDL_SID_MASK                       equ 00E0h

// Register: RXF15EIDH
#define RXF15EIDH RXF15EIDH
RXF15EIDH                                equ 0372Eh
// bitfield definitions
RXF15EIDH_EID8_POSN                      equ 0000h
RXF15EIDH_EID8_POSITION                  equ 0000h
RXF15EIDH_EID8_SIZE                      equ 0001h
RXF15EIDH_EID8_LENGTH                    equ 0001h
RXF15EIDH_EID8_MASK                      equ 0001h
RXF15EIDH_EID9_POSN                      equ 0001h
RXF15EIDH_EID9_POSITION                  equ 0001h
RXF15EIDH_EID9_SIZE                      equ 0001h
RXF15EIDH_EID9_LENGTH                    equ 0001h
RXF15EIDH_EID9_MASK                      equ 0002h
RXF15EIDH_EID10_POSN                     equ 0002h
RXF15EIDH_EID10_POSITION                 equ 0002h
RXF15EIDH_EID10_SIZE                     equ 0001h
RXF15EIDH_EID10_LENGTH                   equ 0001h
RXF15EIDH_EID10_MASK                     equ 0004h
RXF15EIDH_EID11_POSN                     equ 0003h
RXF15EIDH_EID11_POSITION                 equ 0003h
RXF15EIDH_EID11_SIZE                     equ 0001h
RXF15EIDH_EID11_LENGTH                   equ 0001h
RXF15EIDH_EID11_MASK                     equ 0008h
RXF15EIDH_EID12_POSN                     equ 0004h
RXF15EIDH_EID12_POSITION                 equ 0004h
RXF15EIDH_EID12_SIZE                     equ 0001h
RXF15EIDH_EID12_LENGTH                   equ 0001h
RXF15EIDH_EID12_MASK                     equ 0010h
RXF15EIDH_EID13_POSN                     equ 0005h
RXF15EIDH_EID13_POSITION                 equ 0005h
RXF15EIDH_EID13_SIZE                     equ 0001h
RXF15EIDH_EID13_LENGTH                   equ 0001h
RXF15EIDH_EID13_MASK                     equ 0020h
RXF15EIDH_EID14_POSN                     equ 0006h
RXF15EIDH_EID14_POSITION                 equ 0006h
RXF15EIDH_EID14_SIZE                     equ 0001h
RXF15EIDH_EID14_LENGTH                   equ 0001h
RXF15EIDH_EID14_MASK                     equ 0040h
RXF15EIDH_EID15_POSN                     equ 0007h
RXF15EIDH_EID15_POSITION                 equ 0007h
RXF15EIDH_EID15_SIZE                     equ 0001h
RXF15EIDH_EID15_LENGTH                   equ 0001h
RXF15EIDH_EID15_MASK                     equ 0080h
RXF15EIDH_EID_POSN                       equ 0000h
RXF15EIDH_EID_POSITION                   equ 0000h
RXF15EIDH_EID_SIZE                       equ 0008h
RXF15EIDH_EID_LENGTH                     equ 0008h
RXF15EIDH_EID_MASK                       equ 00FFh

// Register: RXF15EIDL
#define RXF15EIDL RXF15EIDL
RXF15EIDL                                equ 0372Fh
// bitfield definitions
RXF15EIDL_EID0_POSN                      equ 0000h
RXF15EIDL_EID0_POSITION                  equ 0000h
RXF15EIDL_EID0_SIZE                      equ 0001h
RXF15EIDL_EID0_LENGTH                    equ 0001h
RXF15EIDL_EID0_MASK                      equ 0001h
RXF15EIDL_EID1_POSN                      equ 0001h
RXF15EIDL_EID1_POSITION                  equ 0001h
RXF15EIDL_EID1_SIZE                      equ 0001h
RXF15EIDL_EID1_LENGTH                    equ 0001h
RXF15EIDL_EID1_MASK                      equ 0002h
RXF15EIDL_EID2_POSN                      equ 0002h
RXF15EIDL_EID2_POSITION                  equ 0002h
RXF15EIDL_EID2_SIZE                      equ 0001h
RXF15EIDL_EID2_LENGTH                    equ 0001h
RXF15EIDL_EID2_MASK                      equ 0004h
RXF15EIDL_EID3_POSN                      equ 0003h
RXF15EIDL_EID3_POSITION                  equ 0003h
RXF15EIDL_EID3_SIZE                      equ 0001h
RXF15EIDL_EID3_LENGTH                    equ 0001h
RXF15EIDL_EID3_MASK                      equ 0008h
RXF15EIDL_EID4_POSN                      equ 0004h
RXF15EIDL_EID4_POSITION                  equ 0004h
RXF15EIDL_EID4_SIZE                      equ 0001h
RXF15EIDL_EID4_LENGTH                    equ 0001h
RXF15EIDL_EID4_MASK                      equ 0010h
RXF15EIDL_EID5_POSN                      equ 0005h
RXF15EIDL_EID5_POSITION                  equ 0005h
RXF15EIDL_EID5_SIZE                      equ 0001h
RXF15EIDL_EID5_LENGTH                    equ 0001h
RXF15EIDL_EID5_MASK                      equ 0020h
RXF15EIDL_EID6_POSN                      equ 0006h
RXF15EIDL_EID6_POSITION                  equ 0006h
RXF15EIDL_EID6_SIZE                      equ 0001h
RXF15EIDL_EID6_LENGTH                    equ 0001h
RXF15EIDL_EID6_MASK                      equ 0040h
RXF15EIDL_EID7_POSN                      equ 0007h
RXF15EIDL_EID7_POSITION                  equ 0007h
RXF15EIDL_EID7_SIZE                      equ 0001h
RXF15EIDL_EID7_LENGTH                    equ 0001h
RXF15EIDL_EID7_MASK                      equ 0080h
RXF15EIDL_EID_POSN                       equ 0000h
RXF15EIDL_EID_POSITION                   equ 0000h
RXF15EIDL_EID_SIZE                       equ 0008h
RXF15EIDL_EID_LENGTH                     equ 0008h
RXF15EIDL_EID_MASK                       equ 00FFh

// Register: SDFLC
#define SDFLC SDFLC
SDFLC                                    equ 03730h
// bitfield definitions
SDFLC_FLC_POSN                           equ 0000h
SDFLC_FLC_POSITION                       equ 0000h
SDFLC_FLC_SIZE                           equ 0005h
SDFLC_FLC_LENGTH                         equ 0005h
SDFLC_FLC_MASK                           equ 001Fh
SDFLC_FLC0_POSN                          equ 0000h
SDFLC_FLC0_POSITION                      equ 0000h
SDFLC_FLC0_SIZE                          equ 0001h
SDFLC_FLC0_LENGTH                        equ 0001h
SDFLC_FLC0_MASK                          equ 0001h
SDFLC_FLC1_POSN                          equ 0001h
SDFLC_FLC1_POSITION                      equ 0001h
SDFLC_FLC1_SIZE                          equ 0001h
SDFLC_FLC1_LENGTH                        equ 0001h
SDFLC_FLC1_MASK                          equ 0002h
SDFLC_FLC2_POSN                          equ 0002h
SDFLC_FLC2_POSITION                      equ 0002h
SDFLC_FLC2_SIZE                          equ 0001h
SDFLC_FLC2_LENGTH                        equ 0001h
SDFLC_FLC2_MASK                          equ 0004h
SDFLC_FLC3_POSN                          equ 0003h
SDFLC_FLC3_POSITION                      equ 0003h
SDFLC_FLC3_SIZE                          equ 0001h
SDFLC_FLC3_LENGTH                        equ 0001h
SDFLC_FLC3_MASK                          equ 0008h
SDFLC_FLC4_POSN                          equ 0004h
SDFLC_FLC4_POSITION                      equ 0004h
SDFLC_FLC4_SIZE                          equ 0001h
SDFLC_FLC4_LENGTH                        equ 0001h
SDFLC_FLC4_MASK                          equ 0010h

// Register: RXFBCON0
#define RXFBCON0 RXFBCON0
RXFBCON0                                 equ 03731h
// bitfield definitions
RXFBCON0_F0BP_POSN                       equ 0000h
RXFBCON0_F0BP_POSITION                   equ 0000h
RXFBCON0_F0BP_SIZE                       equ 0004h
RXFBCON0_F0BP_LENGTH                     equ 0004h
RXFBCON0_F0BP_MASK                       equ 000Fh
RXFBCON0_F1BP_POSN                       equ 0004h
RXFBCON0_F1BP_POSITION                   equ 0004h
RXFBCON0_F1BP_SIZE                       equ 0004h
RXFBCON0_F1BP_LENGTH                     equ 0004h
RXFBCON0_F1BP_MASK                       equ 00F0h
RXFBCON0_F0BP_0_POSN                     equ 0000h
RXFBCON0_F0BP_0_POSITION                 equ 0000h
RXFBCON0_F0BP_0_SIZE                     equ 0001h
RXFBCON0_F0BP_0_LENGTH                   equ 0001h
RXFBCON0_F0BP_0_MASK                     equ 0001h
RXFBCON0_F0BP_1_POSN                     equ 0001h
RXFBCON0_F0BP_1_POSITION                 equ 0001h
RXFBCON0_F0BP_1_SIZE                     equ 0001h
RXFBCON0_F0BP_1_LENGTH                   equ 0001h
RXFBCON0_F0BP_1_MASK                     equ 0002h
RXFBCON0_F0BP_2_POSN                     equ 0002h
RXFBCON0_F0BP_2_POSITION                 equ 0002h
RXFBCON0_F0BP_2_SIZE                     equ 0001h
RXFBCON0_F0BP_2_LENGTH                   equ 0001h
RXFBCON0_F0BP_2_MASK                     equ 0004h
RXFBCON0_F0BP_3_POSN                     equ 0003h
RXFBCON0_F0BP_3_POSITION                 equ 0003h
RXFBCON0_F0BP_3_SIZE                     equ 0001h
RXFBCON0_F0BP_3_LENGTH                   equ 0001h
RXFBCON0_F0BP_3_MASK                     equ 0008h
RXFBCON0_F1BP_0_POSN                     equ 0004h
RXFBCON0_F1BP_0_POSITION                 equ 0004h
RXFBCON0_F1BP_0_SIZE                     equ 0001h
RXFBCON0_F1BP_0_LENGTH                   equ 0001h
RXFBCON0_F1BP_0_MASK                     equ 0010h
RXFBCON0_F1BP_1_POSN                     equ 0005h
RXFBCON0_F1BP_1_POSITION                 equ 0005h
RXFBCON0_F1BP_1_SIZE                     equ 0001h
RXFBCON0_F1BP_1_LENGTH                   equ 0001h
RXFBCON0_F1BP_1_MASK                     equ 0020h
RXFBCON0_F1BP_2_POSN                     equ 0006h
RXFBCON0_F1BP_2_POSITION                 equ 0006h
RXFBCON0_F1BP_2_SIZE                     equ 0001h
RXFBCON0_F1BP_2_LENGTH                   equ 0001h
RXFBCON0_F1BP_2_MASK                     equ 0040h
RXFBCON0_F1BP_3_POSN                     equ 0007h
RXFBCON0_F1BP_3_POSITION                 equ 0007h
RXFBCON0_F1BP_3_SIZE                     equ 0001h
RXFBCON0_F1BP_3_LENGTH                   equ 0001h
RXFBCON0_F1BP_3_MASK                     equ 0080h

