GopalSaraf/Practicals/PSDL/include/proc/pic18f25k83.inc
// Register: MSEL1
#define MSEL1 MSEL1
MSEL1                                    equ 0373Ah
// bitfield definitions
MSEL1_FIL4_POSN                          equ 0000h
MSEL1_FIL4_POSITION                      equ 0000h
MSEL1_FIL4_SIZE                          equ 0002h
MSEL1_FIL4_LENGTH                        equ 0002h
MSEL1_FIL4_MASK                          equ 0003h
MSEL1_FIL5_POSN                          equ 0002h
MSEL1_FIL5_POSITION                      equ 0002h
MSEL1_FIL5_SIZE                          equ 0002h
MSEL1_FIL5_LENGTH                        equ 0002h
MSEL1_FIL5_MASK                          equ 000Ch
MSEL1_FIL6_POSN                          equ 0004h
MSEL1_FIL6_POSITION                      equ 0004h
MSEL1_FIL6_SIZE                          equ 0002h
MSEL1_FIL6_LENGTH                        equ 0002h
MSEL1_FIL6_MASK                          equ 0030h
MSEL1_FIL7_POSN                          equ 0006h
MSEL1_FIL7_POSITION                      equ 0006h
MSEL1_FIL7_SIZE                          equ 0002h
MSEL1_FIL7_LENGTH                        equ 0002h
MSEL1_FIL7_MASK                          equ 00C0h
MSEL1_FIL4_0_POSN                        equ 0000h
MSEL1_FIL4_0_POSITION                    equ 0000h
MSEL1_FIL4_0_SIZE                        equ 0001h
MSEL1_FIL4_0_LENGTH                      equ 0001h
MSEL1_FIL4_0_MASK                        equ 0001h
MSEL1_FIL4_1_POSN                        equ 0001h
MSEL1_FIL4_1_POSITION                    equ 0001h
MSEL1_FIL4_1_SIZE                        equ 0001h
MSEL1_FIL4_1_LENGTH                      equ 0001h
MSEL1_FIL4_1_MASK                        equ 0002h
MSEL1_FIL5_0_POSN                        equ 0002h
MSEL1_FIL5_0_POSITION                    equ 0002h
MSEL1_FIL5_0_SIZE                        equ 0001h
MSEL1_FIL5_0_LENGTH                      equ 0001h
MSEL1_FIL5_0_MASK                        equ 0004h
MSEL1_FIL5_1_POSN                        equ 0003h
MSEL1_FIL5_1_POSITION                    equ 0003h
MSEL1_FIL5_1_SIZE                        equ 0001h
MSEL1_FIL5_1_LENGTH                      equ 0001h
MSEL1_FIL5_1_MASK                        equ 0008h
MSEL1_FIL6_0_POSN                        equ 0004h
MSEL1_FIL6_0_POSITION                    equ 0004h
MSEL1_FIL6_0_SIZE                        equ 0001h
MSEL1_FIL6_0_LENGTH                      equ 0001h
MSEL1_FIL6_0_MASK                        equ 0010h
MSEL1_FIL6_1_POSN                        equ 0005h
MSEL1_FIL6_1_POSITION                    equ 0005h
MSEL1_FIL6_1_SIZE                        equ 0001h
MSEL1_FIL6_1_LENGTH                      equ 0001h
MSEL1_FIL6_1_MASK                        equ 0020h
MSEL1_FIL7_0_POSN                        equ 0006h
MSEL1_FIL7_0_POSITION                    equ 0006h
MSEL1_FIL7_0_SIZE                        equ 0001h
MSEL1_FIL7_0_LENGTH                      equ 0001h
MSEL1_FIL7_0_MASK                        equ 0040h
MSEL1_FIL7_1_POSN                        equ 0007h
MSEL1_FIL7_1_POSITION                    equ 0007h
MSEL1_FIL7_1_SIZE                        equ 0001h
MSEL1_FIL7_1_LENGTH                      equ 0001h
MSEL1_FIL7_1_MASK                        equ 0080h

// Register: MSEL2
#define MSEL2 MSEL2
MSEL2                                    equ 0373Bh
// bitfield definitions
MSEL2_FIL8_POSN                          equ 0000h
MSEL2_FIL8_POSITION                      equ 0000h
MSEL2_FIL8_SIZE                          equ 0002h
MSEL2_FIL8_LENGTH                        equ 0002h
MSEL2_FIL8_MASK                          equ 0003h
MSEL2_FIL9_POSN                          equ 0002h
MSEL2_FIL9_POSITION                      equ 0002h
MSEL2_FIL9_SIZE                          equ 0002h
MSEL2_FIL9_LENGTH                        equ 0002h
MSEL2_FIL9_MASK                          equ 000Ch
MSEL2_FIL10_POSN                         equ 0004h
MSEL2_FIL10_POSITION                     equ 0004h
MSEL2_FIL10_SIZE                         equ 0002h
MSEL2_FIL10_LENGTH                       equ 0002h
MSEL2_FIL10_MASK                         equ 0030h
MSEL2_FIL11_POSN                         equ 0006h
MSEL2_FIL11_POSITION                     equ 0006h
MSEL2_FIL11_SIZE                         equ 0002h
MSEL2_FIL11_LENGTH                       equ 0002h
MSEL2_FIL11_MASK                         equ 00C0h
MSEL2_FIL8_0_POSN                        equ 0000h
MSEL2_FIL8_0_POSITION                    equ 0000h
MSEL2_FIL8_0_SIZE                        equ 0001h
MSEL2_FIL8_0_LENGTH                      equ 0001h
MSEL2_FIL8_0_MASK                        equ 0001h
MSEL2_FIL8_1_POSN                        equ 0001h
MSEL2_FIL8_1_POSITION                    equ 0001h
MSEL2_FIL8_1_SIZE                        equ 0001h
MSEL2_FIL8_1_LENGTH                      equ 0001h
MSEL2_FIL8_1_MASK                        equ 0002h
MSEL2_FIL9_0_POSN                        equ 0002h
MSEL2_FIL9_0_POSITION                    equ 0002h
MSEL2_FIL9_0_SIZE                        equ 0001h
MSEL2_FIL9_0_LENGTH                      equ 0001h
MSEL2_FIL9_0_MASK                        equ 0004h
MSEL2_FIL9_1_POSN                        equ 0003h
MSEL2_FIL9_1_POSITION                    equ 0003h
MSEL2_FIL9_1_SIZE                        equ 0001h
MSEL2_FIL9_1_LENGTH                      equ 0001h
MSEL2_FIL9_1_MASK                        equ 0008h
MSEL2_FIL10_0_POSN                       equ 0004h
MSEL2_FIL10_0_POSITION                   equ 0004h
MSEL2_FIL10_0_SIZE                       equ 0001h
MSEL2_FIL10_0_LENGTH                     equ 0001h
MSEL2_FIL10_0_MASK                       equ 0010h
MSEL2_FIL10_1_POSN                       equ 0005h
MSEL2_FIL10_1_POSITION                   equ 0005h
MSEL2_FIL10_1_SIZE                       equ 0001h
MSEL2_FIL10_1_LENGTH                     equ 0001h
MSEL2_FIL10_1_MASK                       equ 0020h
MSEL2_FIL11_0_POSN                       equ 0006h
MSEL2_FIL11_0_POSITION                   equ 0006h
MSEL2_FIL11_0_SIZE                       equ 0001h
MSEL2_FIL11_0_LENGTH                     equ 0001h
MSEL2_FIL11_0_MASK                       equ 0040h
MSEL2_FIL11_1_POSN                       equ 0007h
MSEL2_FIL11_1_POSITION                   equ 0007h
MSEL2_FIL11_1_SIZE                       equ 0001h
MSEL2_FIL11_1_LENGTH                     equ 0001h
MSEL2_FIL11_1_MASK                       equ 0080h

// Register: MSEL3
#define MSEL3 MSEL3
MSEL3                                    equ 0373Ch
// bitfield definitions
MSEL3_FIL12_POSN                         equ 0000h
MSEL3_FIL12_POSITION                     equ 0000h
MSEL3_FIL12_SIZE                         equ 0002h
MSEL3_FIL12_LENGTH                       equ 0002h
MSEL3_FIL12_MASK                         equ 0003h
MSEL3_FIL13_POSN                         equ 0002h
MSEL3_FIL13_POSITION                     equ 0002h
MSEL3_FIL13_SIZE                         equ 0002h
MSEL3_FIL13_LENGTH                       equ 0002h
MSEL3_FIL13_MASK                         equ 000Ch
MSEL3_FIL14_POSN                         equ 0004h
MSEL3_FIL14_POSITION                     equ 0004h
MSEL3_FIL14_SIZE                         equ 0002h
MSEL3_FIL14_LENGTH                       equ 0002h
MSEL3_FIL14_MASK                         equ 0030h
MSEL3_FIL15_POSN                         equ 0006h
MSEL3_FIL15_POSITION                     equ 0006h
MSEL3_FIL15_SIZE                         equ 0002h
MSEL3_FIL15_LENGTH                       equ 0002h
MSEL3_FIL15_MASK                         equ 00C0h
MSEL3_FIL12_0_POSN                       equ 0000h
MSEL3_FIL12_0_POSITION                   equ 0000h
MSEL3_FIL12_0_SIZE                       equ 0001h
MSEL3_FIL12_0_LENGTH                     equ 0001h
MSEL3_FIL12_0_MASK                       equ 0001h
MSEL3_FIL12_1_POSN                       equ 0001h
MSEL3_FIL12_1_POSITION                   equ 0001h
MSEL3_FIL12_1_SIZE                       equ 0001h
MSEL3_FIL12_1_LENGTH                     equ 0001h
MSEL3_FIL12_1_MASK                       equ 0002h
MSEL3_FIL13_0_POSN                       equ 0002h
MSEL3_FIL13_0_POSITION                   equ 0002h
MSEL3_FIL13_0_SIZE                       equ 0001h
MSEL3_FIL13_0_LENGTH                     equ 0001h
MSEL3_FIL13_0_MASK                       equ 0004h
MSEL3_FIL13_1_POSN                       equ 0003h
MSEL3_FIL13_1_POSITION                   equ 0003h
MSEL3_FIL13_1_SIZE                       equ 0001h
MSEL3_FIL13_1_LENGTH                     equ 0001h
MSEL3_FIL13_1_MASK                       equ 0008h
MSEL3_FIL14_0_POSN                       equ 0004h
MSEL3_FIL14_0_POSITION                   equ 0004h
MSEL3_FIL14_0_SIZE                       equ 0001h
MSEL3_FIL14_0_LENGTH                     equ 0001h
MSEL3_FIL14_0_MASK                       equ 0010h
MSEL3_FIL14_1_POSN                       equ 0005h
MSEL3_FIL14_1_POSITION                   equ 0005h
MSEL3_FIL14_1_SIZE                       equ 0001h
MSEL3_FIL14_1_LENGTH                     equ 0001h
MSEL3_FIL14_1_MASK                       equ 0020h
MSEL3_FIL15_0_POSN                       equ 0006h
MSEL3_FIL15_0_POSITION                   equ 0006h
MSEL3_FIL15_0_SIZE                       equ 0001h
MSEL3_FIL15_0_LENGTH                     equ 0001h
MSEL3_FIL15_0_MASK                       equ 0040h
MSEL3_FIL15_1_POSN                       equ 0007h
MSEL3_FIL15_1_POSITION                   equ 0007h
MSEL3_FIL15_1_SIZE                       equ 0001h
MSEL3_FIL15_1_LENGTH                     equ 0001h
MSEL3_FIL15_1_MASK                       equ 0080h

