GopalSaraf/Practicals/PSDL/include/proc/pic18f25k83.inc
// Register: RXM0EIDH
#define RXM0EIDH RXM0EIDH
RXM0EIDH                                 equ 037BAh
// bitfield definitions
RXM0EIDH_EID8_POSN                       equ 0000h
RXM0EIDH_EID8_POSITION                   equ 0000h
RXM0EIDH_EID8_SIZE                       equ 0001h
RXM0EIDH_EID8_LENGTH                     equ 0001h
RXM0EIDH_EID8_MASK                       equ 0001h
RXM0EIDH_EID9_POSN                       equ 0001h
RXM0EIDH_EID9_POSITION                   equ 0001h
RXM0EIDH_EID9_SIZE                       equ 0001h
RXM0EIDH_EID9_LENGTH                     equ 0001h
RXM0EIDH_EID9_MASK                       equ 0002h
RXM0EIDH_EID10_POSN                      equ 0002h
RXM0EIDH_EID10_POSITION                  equ 0002h
RXM0EIDH_EID10_SIZE                      equ 0001h
RXM0EIDH_EID10_LENGTH                    equ 0001h
RXM0EIDH_EID10_MASK                      equ 0004h
RXM0EIDH_EID11_POSN                      equ 0003h
RXM0EIDH_EID11_POSITION                  equ 0003h
RXM0EIDH_EID11_SIZE                      equ 0001h
RXM0EIDH_EID11_LENGTH                    equ 0001h
RXM0EIDH_EID11_MASK                      equ 0008h
RXM0EIDH_EID12_POSN                      equ 0004h
RXM0EIDH_EID12_POSITION                  equ 0004h
RXM0EIDH_EID12_SIZE                      equ 0001h
RXM0EIDH_EID12_LENGTH                    equ 0001h
RXM0EIDH_EID12_MASK                      equ 0010h
RXM0EIDH_EID13_POSN                      equ 0005h
RXM0EIDH_EID13_POSITION                  equ 0005h
RXM0EIDH_EID13_SIZE                      equ 0001h
RXM0EIDH_EID13_LENGTH                    equ 0001h
RXM0EIDH_EID13_MASK                      equ 0020h
RXM0EIDH_EID14_POSN                      equ 0006h
RXM0EIDH_EID14_POSITION                  equ 0006h
RXM0EIDH_EID14_SIZE                      equ 0001h
RXM0EIDH_EID14_LENGTH                    equ 0001h
RXM0EIDH_EID14_MASK                      equ 0040h
RXM0EIDH_EID15_POSN                      equ 0007h
RXM0EIDH_EID15_POSITION                  equ 0007h
RXM0EIDH_EID15_SIZE                      equ 0001h
RXM0EIDH_EID15_LENGTH                    equ 0001h
RXM0EIDH_EID15_MASK                      equ 0080h
RXM0EIDH_EID_POSN                        equ 0000h
RXM0EIDH_EID_POSITION                    equ 0000h
RXM0EIDH_EID_SIZE                        equ 0008h
RXM0EIDH_EID_LENGTH                      equ 0008h
RXM0EIDH_EID_MASK                        equ 00FFh

// Register: RXM0EIDL
#define RXM0EIDL RXM0EIDL
RXM0EIDL                                 equ 037BBh
// bitfield definitions
RXM0EIDL_EID0_POSN                       equ 0000h
RXM0EIDL_EID0_POSITION                   equ 0000h
RXM0EIDL_EID0_SIZE                       equ 0001h
RXM0EIDL_EID0_LENGTH                     equ 0001h
RXM0EIDL_EID0_MASK                       equ 0001h
RXM0EIDL_EID1_POSN                       equ 0001h
RXM0EIDL_EID1_POSITION                   equ 0001h
RXM0EIDL_EID1_SIZE                       equ 0001h
RXM0EIDL_EID1_LENGTH                     equ 0001h
RXM0EIDL_EID1_MASK                       equ 0002h
RXM0EIDL_EID2_POSN                       equ 0002h
RXM0EIDL_EID2_POSITION                   equ 0002h
RXM0EIDL_EID2_SIZE                       equ 0001h
RXM0EIDL_EID2_LENGTH                     equ 0001h
RXM0EIDL_EID2_MASK                       equ 0004h
RXM0EIDL_EID3_POSN                       equ 0003h
RXM0EIDL_EID3_POSITION                   equ 0003h
RXM0EIDL_EID3_SIZE                       equ 0001h
RXM0EIDL_EID3_LENGTH                     equ 0001h
RXM0EIDL_EID3_MASK                       equ 0008h
RXM0EIDL_EID4_POSN                       equ 0004h
RXM0EIDL_EID4_POSITION                   equ 0004h
RXM0EIDL_EID4_SIZE                       equ 0001h
RXM0EIDL_EID4_LENGTH                     equ 0001h
RXM0EIDL_EID4_MASK                       equ 0010h
RXM0EIDL_EID5_POSN                       equ 0005h
RXM0EIDL_EID5_POSITION                   equ 0005h
RXM0EIDL_EID5_SIZE                       equ 0001h
RXM0EIDL_EID5_LENGTH                     equ 0001h
RXM0EIDL_EID5_MASK                       equ 0020h
RXM0EIDL_EID6_POSN                       equ 0006h
RXM0EIDL_EID6_POSITION                   equ 0006h
RXM0EIDL_EID6_SIZE                       equ 0001h
RXM0EIDL_EID6_LENGTH                     equ 0001h
RXM0EIDL_EID6_MASK                       equ 0040h
RXM0EIDL_EID7_POSN                       equ 0007h
RXM0EIDL_EID7_POSITION                   equ 0007h
RXM0EIDL_EID7_SIZE                       equ 0001h
RXM0EIDL_EID7_LENGTH                     equ 0001h
RXM0EIDL_EID7_MASK                       equ 0080h
RXM0EIDL_EID_POSN                        equ 0000h
RXM0EIDL_EID_POSITION                    equ 0000h
RXM0EIDL_EID_SIZE                        equ 0008h
RXM0EIDL_EID_LENGTH                      equ 0008h
RXM0EIDL_EID_MASK                        equ 00FFh

// Register: RXM1SIDH
#define RXM1SIDH RXM1SIDH
RXM1SIDH                                 equ 037BCh
// bitfield definitions
RXM1SIDH_SID3_POSN                       equ 0000h
RXM1SIDH_SID3_POSITION                   equ 0000h
RXM1SIDH_SID3_SIZE                       equ 0001h
RXM1SIDH_SID3_LENGTH                     equ 0001h
RXM1SIDH_SID3_MASK                       equ 0001h
RXM1SIDH_SID4_POSN                       equ 0001h
RXM1SIDH_SID4_POSITION                   equ 0001h
RXM1SIDH_SID4_SIZE                       equ 0001h
RXM1SIDH_SID4_LENGTH                     equ 0001h
RXM1SIDH_SID4_MASK                       equ 0002h
RXM1SIDH_SID5_POSN                       equ 0002h
RXM1SIDH_SID5_POSITION                   equ 0002h
RXM1SIDH_SID5_SIZE                       equ 0001h
RXM1SIDH_SID5_LENGTH                     equ 0001h
RXM1SIDH_SID5_MASK                       equ 0004h
RXM1SIDH_SID6_POSN                       equ 0003h
RXM1SIDH_SID6_POSITION                   equ 0003h
RXM1SIDH_SID6_SIZE                       equ 0001h
RXM1SIDH_SID6_LENGTH                     equ 0001h
RXM1SIDH_SID6_MASK                       equ 0008h
RXM1SIDH_SID7_POSN                       equ 0004h
RXM1SIDH_SID7_POSITION                   equ 0004h
RXM1SIDH_SID7_SIZE                       equ 0001h
RXM1SIDH_SID7_LENGTH                     equ 0001h
RXM1SIDH_SID7_MASK                       equ 0010h
RXM1SIDH_SID8_POSN                       equ 0005h
RXM1SIDH_SID8_POSITION                   equ 0005h
RXM1SIDH_SID8_SIZE                       equ 0001h
RXM1SIDH_SID8_LENGTH                     equ 0001h
RXM1SIDH_SID8_MASK                       equ 0020h
RXM1SIDH_SID9_POSN                       equ 0006h
RXM1SIDH_SID9_POSITION                   equ 0006h
RXM1SIDH_SID9_SIZE                       equ 0001h
RXM1SIDH_SID9_LENGTH                     equ 0001h
RXM1SIDH_SID9_MASK                       equ 0040h
RXM1SIDH_SID10_POSN                      equ 0007h
RXM1SIDH_SID10_POSITION                  equ 0007h
RXM1SIDH_SID10_SIZE                      equ 0001h
RXM1SIDH_SID10_LENGTH                    equ 0001h
RXM1SIDH_SID10_MASK                      equ 0080h
RXM1SIDH_EID21_POSN                      equ 0000h
RXM1SIDH_EID21_POSITION                  equ 0000h
RXM1SIDH_EID21_SIZE                      equ 0001h
RXM1SIDH_EID21_LENGTH                    equ 0001h
RXM1SIDH_EID21_MASK                      equ 0001h
RXM1SIDH_EID22_POSN                      equ 0001h
RXM1SIDH_EID22_POSITION                  equ 0001h
RXM1SIDH_EID22_SIZE                      equ 0001h
RXM1SIDH_EID22_LENGTH                    equ 0001h
RXM1SIDH_EID22_MASK                      equ 0002h
RXM1SIDH_EID23_POSN                      equ 0002h
RXM1SIDH_EID23_POSITION                  equ 0002h
RXM1SIDH_EID23_SIZE                      equ 0001h
RXM1SIDH_EID23_LENGTH                    equ 0001h
RXM1SIDH_EID23_MASK                      equ 0004h
RXM1SIDH_EID24_POSN                      equ 0003h
RXM1SIDH_EID24_POSITION                  equ 0003h
RXM1SIDH_EID24_SIZE                      equ 0001h
RXM1SIDH_EID24_LENGTH                    equ 0001h
RXM1SIDH_EID24_MASK                      equ 0008h
RXM1SIDH_EID25_POSN                      equ 0004h
RXM1SIDH_EID25_POSITION                  equ 0004h
RXM1SIDH_EID25_SIZE                      equ 0001h
RXM1SIDH_EID25_LENGTH                    equ 0001h
RXM1SIDH_EID25_MASK                      equ 0010h
RXM1SIDH_EID26_POSN                      equ 0005h
RXM1SIDH_EID26_POSITION                  equ 0005h
RXM1SIDH_EID26_SIZE                      equ 0001h
RXM1SIDH_EID26_LENGTH                    equ 0001h
RXM1SIDH_EID26_MASK                      equ 0020h
RXM1SIDH_EID27_POSN                      equ 0006h
RXM1SIDH_EID27_POSITION                  equ 0006h
RXM1SIDH_EID27_SIZE                      equ 0001h
RXM1SIDH_EID27_LENGTH                    equ 0001h
RXM1SIDH_EID27_MASK                      equ 0040h
RXM1SIDH_EID28_POSN                      equ 0007h
RXM1SIDH_EID28_POSITION                  equ 0007h
RXM1SIDH_EID28_SIZE                      equ 0001h
RXM1SIDH_EID28_LENGTH                    equ 0001h
RXM1SIDH_EID28_MASK                      equ 0080h
RXM1SIDH_SID_POSN                        equ 0000h
RXM1SIDH_SID_POSITION                    equ 0000h
RXM1SIDH_SID_SIZE                        equ 0008h
RXM1SIDH_SID_LENGTH                      equ 0008h
RXM1SIDH_SID_MASK                        equ 00FFh

// Register: RXM1SIDL
#define RXM1SIDL RXM1SIDL
RXM1SIDL                                 equ 037BDh
// bitfield definitions
RXM1SIDL_EID16_POSN                      equ 0000h
RXM1SIDL_EID16_POSITION                  equ 0000h
RXM1SIDL_EID16_SIZE                      equ 0001h
RXM1SIDL_EID16_LENGTH                    equ 0001h
RXM1SIDL_EID16_MASK                      equ 0001h
RXM1SIDL_EID17_POSN                      equ 0001h
RXM1SIDL_EID17_POSITION                  equ 0001h
RXM1SIDL_EID17_SIZE                      equ 0001h
RXM1SIDL_EID17_LENGTH                    equ 0001h
RXM1SIDL_EID17_MASK                      equ 0002h
RXM1SIDL_EXIDEN_POSN                     equ 0003h
RXM1SIDL_EXIDEN_POSITION                 equ 0003h
RXM1SIDL_EXIDEN_SIZE                     equ 0001h
RXM1SIDL_EXIDEN_LENGTH                   equ 0001h
RXM1SIDL_EXIDEN_MASK                     equ 0008h
RXM1SIDL_SID0_POSN                       equ 0005h
RXM1SIDL_SID0_POSITION                   equ 0005h
RXM1SIDL_SID0_SIZE                       equ 0001h
RXM1SIDL_SID0_LENGTH                     equ 0001h
RXM1SIDL_SID0_MASK                       equ 0020h
RXM1SIDL_SID1_POSN                       equ 0006h
RXM1SIDL_SID1_POSITION                   equ 0006h
RXM1SIDL_SID1_SIZE                       equ 0001h
RXM1SIDL_SID1_LENGTH                     equ 0001h
RXM1SIDL_SID1_MASK                       equ 0040h
RXM1SIDL_SID2_POSN                       equ 0007h
RXM1SIDL_SID2_POSITION                   equ 0007h
RXM1SIDL_SID2_SIZE                       equ 0001h
RXM1SIDL_SID2_LENGTH                     equ 0001h
RXM1SIDL_SID2_MASK                       equ 0080h
RXM1SIDL_EID18_POSN                      equ 0005h
RXM1SIDL_EID18_POSITION                  equ 0005h
RXM1SIDL_EID18_SIZE                      equ 0001h
RXM1SIDL_EID18_LENGTH                    equ 0001h
RXM1SIDL_EID18_MASK                      equ 0020h
RXM1SIDL_EID19_POSN                      equ 0006h
RXM1SIDL_EID19_POSITION                  equ 0006h
RXM1SIDL_EID19_SIZE                      equ 0001h
RXM1SIDL_EID19_LENGTH                    equ 0001h
RXM1SIDL_EID19_MASK                      equ 0040h
RXM1SIDL_EID20_POSN                      equ 0007h
RXM1SIDL_EID20_POSITION                  equ 0007h
RXM1SIDL_EID20_SIZE                      equ 0001h
RXM1SIDL_EID20_LENGTH                    equ 0001h
RXM1SIDL_EID20_MASK                      equ 0080h
RXM1SIDL_EID_POSN                        equ 0000h
RXM1SIDL_EID_POSITION                    equ 0000h
RXM1SIDL_EID_SIZE                        equ 0002h
RXM1SIDL_EID_LENGTH                      equ 0002h
RXM1SIDL_EID_MASK                        equ 0003h
RXM1SIDL_SID_POSN                        equ 0005h
RXM1SIDL_SID_POSITION                    equ 0005h
RXM1SIDL_SID_SIZE                        equ 0003h
RXM1SIDL_SID_LENGTH                      equ 0003h
RXM1SIDL_SID_MASK                        equ 00E0h

