GopalSaraf/Practicals/PSDL/include/proc/pic18f25k83.inc
// Register: TXB2D3
#define TXB2D3 TXB2D3
TXB2D3                                   equ 037C9h
// bitfield definitions
TXB2D3_TXB2D3_POSN                       equ 0000h
TXB2D3_TXB2D3_POSITION                   equ 0000h
TXB2D3_TXB2D3_SIZE                       equ 0008h
TXB2D3_TXB2D3_LENGTH                     equ 0008h
TXB2D3_TXB2D3_MASK                       equ 00FFh
TXB2D3_TXB2D30_POSN                      equ 0000h
TXB2D3_TXB2D30_POSITION                  equ 0000h
TXB2D3_TXB2D30_SIZE                      equ 0001h
TXB2D3_TXB2D30_LENGTH                    equ 0001h
TXB2D3_TXB2D30_MASK                      equ 0001h
TXB2D3_TXB2D31_POSN                      equ 0001h
TXB2D3_TXB2D31_POSITION                  equ 0001h
TXB2D3_TXB2D31_SIZE                      equ 0001h
TXB2D3_TXB2D31_LENGTH                    equ 0001h
TXB2D3_TXB2D31_MASK                      equ 0002h
TXB2D3_TXB2D32_POSN                      equ 0002h
TXB2D3_TXB2D32_POSITION                  equ 0002h
TXB2D3_TXB2D32_SIZE                      equ 0001h
TXB2D3_TXB2D32_LENGTH                    equ 0001h
TXB2D3_TXB2D32_MASK                      equ 0004h
TXB2D3_TXB2D33_POSN                      equ 0003h
TXB2D3_TXB2D33_POSITION                  equ 0003h
TXB2D3_TXB2D33_SIZE                      equ 0001h
TXB2D3_TXB2D33_LENGTH                    equ 0001h
TXB2D3_TXB2D33_MASK                      equ 0008h
TXB2D3_TXB2D34_POSN                      equ 0004h
TXB2D3_TXB2D34_POSITION                  equ 0004h
TXB2D3_TXB2D34_SIZE                      equ 0001h
TXB2D3_TXB2D34_LENGTH                    equ 0001h
TXB2D3_TXB2D34_MASK                      equ 0010h
TXB2D3_TXB2D35_POSN                      equ 0005h
TXB2D3_TXB2D35_POSITION                  equ 0005h
TXB2D3_TXB2D35_SIZE                      equ 0001h
TXB2D3_TXB2D35_LENGTH                    equ 0001h
TXB2D3_TXB2D35_MASK                      equ 0020h
TXB2D3_TXB2D36_POSN                      equ 0006h
TXB2D3_TXB2D36_POSITION                  equ 0006h
TXB2D3_TXB2D36_SIZE                      equ 0001h
TXB2D3_TXB2D36_LENGTH                    equ 0001h
TXB2D3_TXB2D36_MASK                      equ 0040h
TXB2D3_TXB2D37_POSN                      equ 0007h
TXB2D3_TXB2D37_POSITION                  equ 0007h
TXB2D3_TXB2D37_SIZE                      equ 0001h
TXB2D3_TXB2D37_LENGTH                    equ 0001h
TXB2D3_TXB2D37_MASK                      equ 0080h

// Register: TXB2D4
#define TXB2D4 TXB2D4
TXB2D4                                   equ 037CAh
// bitfield definitions
TXB2D4_TXB2D4_POSN                       equ 0000h
TXB2D4_TXB2D4_POSITION                   equ 0000h
TXB2D4_TXB2D4_SIZE                       equ 0008h
TXB2D4_TXB2D4_LENGTH                     equ 0008h
TXB2D4_TXB2D4_MASK                       equ 00FFh
TXB2D4_TXB2D40_POSN                      equ 0000h
TXB2D4_TXB2D40_POSITION                  equ 0000h
TXB2D4_TXB2D40_SIZE                      equ 0001h
TXB2D4_TXB2D40_LENGTH                    equ 0001h
TXB2D4_TXB2D40_MASK                      equ 0001h
TXB2D4_TXB2D41_POSN                      equ 0001h
TXB2D4_TXB2D41_POSITION                  equ 0001h
TXB2D4_TXB2D41_SIZE                      equ 0001h
TXB2D4_TXB2D41_LENGTH                    equ 0001h
TXB2D4_TXB2D41_MASK                      equ 0002h
TXB2D4_TXB2D42_POSN                      equ 0002h
TXB2D4_TXB2D42_POSITION                  equ 0002h
TXB2D4_TXB2D42_SIZE                      equ 0001h
TXB2D4_TXB2D42_LENGTH                    equ 0001h
TXB2D4_TXB2D42_MASK                      equ 0004h
TXB2D4_TXB2D43_POSN                      equ 0003h
TXB2D4_TXB2D43_POSITION                  equ 0003h
TXB2D4_TXB2D43_SIZE                      equ 0001h
TXB2D4_TXB2D43_LENGTH                    equ 0001h
TXB2D4_TXB2D43_MASK                      equ 0008h
TXB2D4_TXB2D44_POSN                      equ 0004h
TXB2D4_TXB2D44_POSITION                  equ 0004h
TXB2D4_TXB2D44_SIZE                      equ 0001h
TXB2D4_TXB2D44_LENGTH                    equ 0001h
TXB2D4_TXB2D44_MASK                      equ 0010h
TXB2D4_TXB2D45_POSN                      equ 0005h
TXB2D4_TXB2D45_POSITION                  equ 0005h
TXB2D4_TXB2D45_SIZE                      equ 0001h
TXB2D4_TXB2D45_LENGTH                    equ 0001h
TXB2D4_TXB2D45_MASK                      equ 0020h
TXB2D4_TXB2D46_POSN                      equ 0006h
TXB2D4_TXB2D46_POSITION                  equ 0006h
TXB2D4_TXB2D46_SIZE                      equ 0001h
TXB2D4_TXB2D46_LENGTH                    equ 0001h
TXB2D4_TXB2D46_MASK                      equ 0040h
TXB2D4_TXB2D47_POSN                      equ 0007h
TXB2D4_TXB2D47_POSITION                  equ 0007h
TXB2D4_TXB2D47_SIZE                      equ 0001h
TXB2D4_TXB2D47_LENGTH                    equ 0001h
TXB2D4_TXB2D47_MASK                      equ 0080h

// Register: TXB2D5
#define TXB2D5 TXB2D5
TXB2D5                                   equ 037CBh
// bitfield definitions
TXB2D5_TXB2D5_POSN                       equ 0000h
TXB2D5_TXB2D5_POSITION                   equ 0000h
TXB2D5_TXB2D5_SIZE                       equ 0008h
TXB2D5_TXB2D5_LENGTH                     equ 0008h
TXB2D5_TXB2D5_MASK                       equ 00FFh
TXB2D5_TXB2D50_POSN                      equ 0000h
TXB2D5_TXB2D50_POSITION                  equ 0000h
TXB2D5_TXB2D50_SIZE                      equ 0001h
TXB2D5_TXB2D50_LENGTH                    equ 0001h
TXB2D5_TXB2D50_MASK                      equ 0001h
TXB2D5_TXB2D51_POSN                      equ 0001h
TXB2D5_TXB2D51_POSITION                  equ 0001h
TXB2D5_TXB2D51_SIZE                      equ 0001h
TXB2D5_TXB2D51_LENGTH                    equ 0001h
TXB2D5_TXB2D51_MASK                      equ 0002h
TXB2D5_TXB2D52_POSN                      equ 0002h
TXB2D5_TXB2D52_POSITION                  equ 0002h
TXB2D5_TXB2D52_SIZE                      equ 0001h
TXB2D5_TXB2D52_LENGTH                    equ 0001h
TXB2D5_TXB2D52_MASK                      equ 0004h
TXB2D5_TXB2D53_POSN                      equ 0003h
TXB2D5_TXB2D53_POSITION                  equ 0003h
TXB2D5_TXB2D53_SIZE                      equ 0001h
TXB2D5_TXB2D53_LENGTH                    equ 0001h
TXB2D5_TXB2D53_MASK                      equ 0008h
TXB2D5_TXB2D54_POSN                      equ 0004h
TXB2D5_TXB2D54_POSITION                  equ 0004h
TXB2D5_TXB2D54_SIZE                      equ 0001h
TXB2D5_TXB2D54_LENGTH                    equ 0001h
TXB2D5_TXB2D54_MASK                      equ 0010h
TXB2D5_TXB2D55_POSN                      equ 0005h
TXB2D5_TXB2D55_POSITION                  equ 0005h
TXB2D5_TXB2D55_SIZE                      equ 0001h
TXB2D5_TXB2D55_LENGTH                    equ 0001h
TXB2D5_TXB2D55_MASK                      equ 0020h
TXB2D5_TXB2D56_POSN                      equ 0006h
TXB2D5_TXB2D56_POSITION                  equ 0006h
TXB2D5_TXB2D56_SIZE                      equ 0001h
TXB2D5_TXB2D56_LENGTH                    equ 0001h
TXB2D5_TXB2D56_MASK                      equ 0040h
TXB2D5_TXB2D57_POSN                      equ 0007h
TXB2D5_TXB2D57_POSITION                  equ 0007h
TXB2D5_TXB2D57_SIZE                      equ 0001h
TXB2D5_TXB2D57_LENGTH                    equ 0001h
TXB2D5_TXB2D57_MASK                      equ 0080h

// Register: TXB2D6
#define TXB2D6 TXB2D6
TXB2D6                                   equ 037CCh
// bitfield definitions
TXB2D6_TXB2D6_POSN                       equ 0000h
TXB2D6_TXB2D6_POSITION                   equ 0000h
TXB2D6_TXB2D6_SIZE                       equ 0008h
TXB2D6_TXB2D6_LENGTH                     equ 0008h
TXB2D6_TXB2D6_MASK                       equ 00FFh
TXB2D6_TXB2D60_POSN                      equ 0000h
TXB2D6_TXB2D60_POSITION                  equ 0000h
TXB2D6_TXB2D60_SIZE                      equ 0001h
TXB2D6_TXB2D60_LENGTH                    equ 0001h
TXB2D6_TXB2D60_MASK                      equ 0001h
TXB2D6_TXB2D61_POSN                      equ 0001h
TXB2D6_TXB2D61_POSITION                  equ 0001h
TXB2D6_TXB2D61_SIZE                      equ 0001h
TXB2D6_TXB2D61_LENGTH                    equ 0001h
TXB2D6_TXB2D61_MASK                      equ 0002h
TXB2D6_TXB2D62_POSN                      equ 0002h
TXB2D6_TXB2D62_POSITION                  equ 0002h
TXB2D6_TXB2D62_SIZE                      equ 0001h
TXB2D6_TXB2D62_LENGTH                    equ 0001h
TXB2D6_TXB2D62_MASK                      equ 0004h
TXB2D6_TXB2D63_POSN                      equ 0003h
TXB2D6_TXB2D63_POSITION                  equ 0003h
TXB2D6_TXB2D63_SIZE                      equ 0001h
TXB2D6_TXB2D63_LENGTH                    equ 0001h
TXB2D6_TXB2D63_MASK                      equ 0008h
TXB2D6_TXB2D64_POSN                      equ 0004h
TXB2D6_TXB2D64_POSITION                  equ 0004h
TXB2D6_TXB2D64_SIZE                      equ 0001h
TXB2D6_TXB2D64_LENGTH                    equ 0001h
TXB2D6_TXB2D64_MASK                      equ 0010h
TXB2D6_TXB2D65_POSN                      equ 0005h
TXB2D6_TXB2D65_POSITION                  equ 0005h
TXB2D6_TXB2D65_SIZE                      equ 0001h
TXB2D6_TXB2D65_LENGTH                    equ 0001h
TXB2D6_TXB2D65_MASK                      equ 0020h
TXB2D6_TXB2D66_POSN                      equ 0006h
TXB2D6_TXB2D66_POSITION                  equ 0006h
TXB2D6_TXB2D66_SIZE                      equ 0001h
TXB2D6_TXB2D66_LENGTH                    equ 0001h
TXB2D6_TXB2D66_MASK                      equ 0040h
TXB2D6_TXB2D67_POSN                      equ 0007h
TXB2D6_TXB2D67_POSITION                  equ 0007h
TXB2D6_TXB2D67_SIZE                      equ 0001h
TXB2D6_TXB2D67_LENGTH                    equ 0001h
TXB2D6_TXB2D67_MASK                      equ 0080h

// Register: TXB2D7
#define TXB2D7 TXB2D7
TXB2D7                                   equ 037CDh
// bitfield definitions
TXB2D7_TXB2D7_POSN                       equ 0000h
TXB2D7_TXB2D7_POSITION                   equ 0000h
TXB2D7_TXB2D7_SIZE                       equ 0008h
TXB2D7_TXB2D7_LENGTH                     equ 0008h
TXB2D7_TXB2D7_MASK                       equ 00FFh
TXB2D7_TXB2D70_POSN                      equ 0000h
TXB2D7_TXB2D70_POSITION                  equ 0000h
TXB2D7_TXB2D70_SIZE                      equ 0001h
TXB2D7_TXB2D70_LENGTH                    equ 0001h
TXB2D7_TXB2D70_MASK                      equ 0001h
TXB2D7_TXB2D71_POSN                      equ 0001h
TXB2D7_TXB2D71_POSITION                  equ 0001h
TXB2D7_TXB2D71_SIZE                      equ 0001h
TXB2D7_TXB2D71_LENGTH                    equ 0001h
TXB2D7_TXB2D71_MASK                      equ 0002h
TXB2D7_TXB2D72_POSN                      equ 0002h
TXB2D7_TXB2D72_POSITION                  equ 0002h
TXB2D7_TXB2D72_SIZE                      equ 0001h
TXB2D7_TXB2D72_LENGTH                    equ 0001h
TXB2D7_TXB2D72_MASK                      equ 0004h
TXB2D7_TXB2D73_POSN                      equ 0003h
TXB2D7_TXB2D73_POSITION                  equ 0003h
TXB2D7_TXB2D73_SIZE                      equ 0001h
TXB2D7_TXB2D73_LENGTH                    equ 0001h
TXB2D7_TXB2D73_MASK                      equ 0008h
TXB2D7_TXB2D74_POSN                      equ 0004h
TXB2D7_TXB2D74_POSITION                  equ 0004h
TXB2D7_TXB2D74_SIZE                      equ 0001h
TXB2D7_TXB2D74_LENGTH                    equ 0001h
TXB2D7_TXB2D74_MASK                      equ 0010h
TXB2D7_TXB2D75_POSN                      equ 0005h
TXB2D7_TXB2D75_POSITION                  equ 0005h
TXB2D7_TXB2D75_SIZE                      equ 0001h
TXB2D7_TXB2D75_LENGTH                    equ 0001h
TXB2D7_TXB2D75_MASK                      equ 0020h
TXB2D7_TXB2D76_POSN                      equ 0006h
TXB2D7_TXB2D76_POSITION                  equ 0006h
TXB2D7_TXB2D76_SIZE                      equ 0001h
TXB2D7_TXB2D76_LENGTH                    equ 0001h
TXB2D7_TXB2D76_MASK                      equ 0040h
TXB2D7_TXB2D77_POSN                      equ 0007h
TXB2D7_TXB2D77_POSITION                  equ 0007h
TXB2D7_TXB2D77_SIZE                      equ 0001h
TXB2D7_TXB2D77_LENGTH                    equ 0001h
TXB2D7_TXB2D77_MASK                      equ 0080h

// Register: CANSTAT_R03
#define CANSTAT_R03 CANSTAT_R03
CANSTAT_R03                              equ 037CEh
// bitfield definitions
CANSTAT_R03_EICODE0_POSN                 equ 0000h
CANSTAT_R03_EICODE0_POSITION             equ 0000h
CANSTAT_R03_EICODE0_SIZE                 equ 0001h
CANSTAT_R03_EICODE0_LENGTH               equ 0001h
CANSTAT_R03_EICODE0_MASK                 equ 0001h
CANSTAT_R03_EICODE1_ICODE0_POSN          equ 0001h
CANSTAT_R03_EICODE1_ICODE0_POSITION      equ 0001h
CANSTAT_R03_EICODE1_ICODE0_SIZE          equ 0001h
CANSTAT_R03_EICODE1_ICODE0_LENGTH        equ 0001h
CANSTAT_R03_EICODE1_ICODE0_MASK          equ 0002h
CANSTAT_R03_EICODE2_ICODE1_POSN          equ 0002h
CANSTAT_R03_EICODE2_ICODE1_POSITION      equ 0002h
CANSTAT_R03_EICODE2_ICODE1_SIZE          equ 0001h
CANSTAT_R03_EICODE2_ICODE1_LENGTH        equ 0001h
CANSTAT_R03_EICODE2_ICODE1_MASK          equ 0004h
CANSTAT_R03_EICODE3_ICODE2_POSN          equ 0003h
CANSTAT_R03_EICODE3_ICODE2_POSITION      equ 0003h
CANSTAT_R03_EICODE3_ICODE2_SIZE          equ 0001h
CANSTAT_R03_EICODE3_ICODE2_LENGTH        equ 0001h
CANSTAT_R03_EICODE3_ICODE2_MASK          equ 0008h
CANSTAT_R03_EICODE4_POSN                 equ 0004h
CANSTAT_R03_EICODE4_POSITION             equ 0004h
CANSTAT_R03_EICODE4_SIZE                 equ 0001h
CANSTAT_R03_EICODE4_LENGTH               equ 0001h
CANSTAT_R03_EICODE4_MASK                 equ 0010h
CANSTAT_R03_OPMODE_POSN                  equ 0005h
CANSTAT_R03_OPMODE_POSITION              equ 0005h
CANSTAT_R03_OPMODE_SIZE                  equ 0003h
CANSTAT_R03_OPMODE_LENGTH                equ 0003h
CANSTAT_R03_OPMODE_MASK                  equ 00E0h
CANSTAT_R03_EICODE1_POSN                 equ 0001h
CANSTAT_R03_EICODE1_POSITION             equ 0001h
CANSTAT_R03_EICODE1_SIZE                 equ 0001h
CANSTAT_R03_EICODE1_LENGTH               equ 0001h
CANSTAT_R03_EICODE1_MASK                 equ 0002h
CANSTAT_R03_EICODE2_POSN                 equ 0002h
CANSTAT_R03_EICODE2_POSITION             equ 0002h
CANSTAT_R03_EICODE2_SIZE                 equ 0001h
CANSTAT_R03_EICODE2_LENGTH               equ 0001h
CANSTAT_R03_EICODE2_MASK                 equ 0004h
CANSTAT_R03_EICODE3_POSN                 equ 0003h
CANSTAT_R03_EICODE3_POSITION             equ 0003h
CANSTAT_R03_EICODE3_SIZE                 equ 0001h
CANSTAT_R03_EICODE3_LENGTH               equ 0001h
CANSTAT_R03_EICODE3_MASK                 equ 0008h
CANSTAT_R03_OPMODE0_POSN                 equ 0005h
CANSTAT_R03_OPMODE0_POSITION             equ 0005h
CANSTAT_R03_OPMODE0_SIZE                 equ 0001h
CANSTAT_R03_OPMODE0_LENGTH               equ 0001h
CANSTAT_R03_OPMODE0_MASK                 equ 0020h
CANSTAT_R03_OPMODE1_POSN                 equ 0006h
CANSTAT_R03_OPMODE1_POSITION             equ 0006h
CANSTAT_R03_OPMODE1_SIZE                 equ 0001h
CANSTAT_R03_OPMODE1_LENGTH               equ 0001h
CANSTAT_R03_OPMODE1_MASK                 equ 0040h
CANSTAT_R03_OPMODE2_POSN                 equ 0007h
CANSTAT_R03_OPMODE2_POSITION             equ 0007h
CANSTAT_R03_OPMODE2_SIZE                 equ 0001h
CANSTAT_R03_OPMODE2_LENGTH               equ 0001h
CANSTAT_R03_OPMODE2_MASK                 equ 0080h
CANSTAT_R03_ICODE0_POSN                  equ 0001h
CANSTAT_R03_ICODE0_POSITION              equ 0001h
CANSTAT_R03_ICODE0_SIZE                  equ 0001h
CANSTAT_R03_ICODE0_LENGTH                equ 0001h
CANSTAT_R03_ICODE0_MASK                  equ 0002h
CANSTAT_R03_ICODE1_POSN                  equ 0002h
CANSTAT_R03_ICODE1_POSITION              equ 0002h
CANSTAT_R03_ICODE1_SIZE                  equ 0001h
CANSTAT_R03_ICODE1_LENGTH                equ 0001h
CANSTAT_R03_ICODE1_MASK                  equ 0004h
CANSTAT_R03_ICODE2_POSN                  equ 0003h
CANSTAT_R03_ICODE2_POSITION              equ 0003h
CANSTAT_R03_ICODE2_SIZE                  equ 0001h
CANSTAT_R03_ICODE2_LENGTH                equ 0001h
CANSTAT_R03_ICODE2_MASK                  equ 0008h
CANSTAT_R03_EICODE_POSN                  equ 0000h
CANSTAT_R03_EICODE_POSITION              equ 0000h
CANSTAT_R03_EICODE_SIZE                  equ 0005h
CANSTAT_R03_EICODE_LENGTH                equ 0005h
CANSTAT_R03_EICODE_MASK                  equ 001Fh
CANSTAT_R03_ICODE_POSN                   equ 0001h
CANSTAT_R03_ICODE_POSITION               equ 0001h
CANSTAT_R03_ICODE_SIZE                   equ 0003h
CANSTAT_R03_ICODE_LENGTH                 equ 0003h
CANSTAT_R03_ICODE_MASK                   equ 000Eh

// Register: CANCON_R03
#define CANCON_R03 CANCON_R03
CANCON_R03                               equ 037CFh
// bitfield definitions
CANCON_R03_FP0_POSN                      equ 0000h
CANCON_R03_FP0_POSITION                  equ 0000h
CANCON_R03_FP0_SIZE                      equ 0001h
CANCON_R03_FP0_LENGTH                    equ 0001h
CANCON_R03_FP0_MASK                      equ 0001h
CANCON_R03_WIN0_FP1_POSN                 equ 0001h
CANCON_R03_WIN0_FP1_POSITION             equ 0001h
CANCON_R03_WIN0_FP1_SIZE                 equ 0001h
CANCON_R03_WIN0_FP1_LENGTH               equ 0001h
CANCON_R03_WIN0_FP1_MASK                 equ 0002h
CANCON_R03_WIN1_FP2_POSN                 equ 0002h
CANCON_R03_WIN1_FP2_POSITION             equ 0002h
CANCON_R03_WIN1_FP2_SIZE                 equ 0001h
CANCON_R03_WIN1_FP2_LENGTH               equ 0001h
CANCON_R03_WIN1_FP2_MASK                 equ 0004h
CANCON_R03_WIN2_FP3_POSN                 equ 0003h
CANCON_R03_WIN2_FP3_POSITION             equ 0003h
CANCON_R03_WIN2_FP3_SIZE                 equ 0001h
CANCON_R03_WIN2_FP3_LENGTH               equ 0001h
CANCON_R03_WIN2_FP3_MASK                 equ 0008h
CANCON_R03_ABAT_POSN                     equ 0004h
CANCON_R03_ABAT_POSITION                 equ 0004h
CANCON_R03_ABAT_SIZE                     equ 0001h
CANCON_R03_ABAT_LENGTH                   equ 0001h
CANCON_R03_ABAT_MASK                     equ 0010h
CANCON_R03_REQOP_POSN                    equ 0005h
CANCON_R03_REQOP_POSITION                equ 0005h
CANCON_R03_REQOP_SIZE                    equ 0003h
CANCON_R03_REQOP_LENGTH                  equ 0003h
CANCON_R03_REQOP_MASK                    equ 00E0h
CANCON_R03_WIN0_POSN                     equ 0001h
CANCON_R03_WIN0_POSITION                 equ 0001h
CANCON_R03_WIN0_SIZE                     equ 0001h
CANCON_R03_WIN0_LENGTH                   equ 0001h
CANCON_R03_WIN0_MASK                     equ 0002h
CANCON_R03_WIN1_POSN                     equ 0002h
CANCON_R03_WIN1_POSITION                 equ 0002h
CANCON_R03_WIN1_SIZE                     equ 0001h
CANCON_R03_WIN1_LENGTH                   equ 0001h
CANCON_R03_WIN1_MASK                     equ 0004h
CANCON_R03_WIN2_POSN                     equ 0003h
CANCON_R03_WIN2_POSITION                 equ 0003h
CANCON_R03_WIN2_SIZE                     equ 0001h
CANCON_R03_WIN2_LENGTH                   equ 0001h
CANCON_R03_WIN2_MASK                     equ 0008h
CANCON_R03_REQOP0_POSN                   equ 0005h
CANCON_R03_REQOP0_POSITION               equ 0005h
CANCON_R03_REQOP0_SIZE                   equ 0001h
CANCON_R03_REQOP0_LENGTH                 equ 0001h
CANCON_R03_REQOP0_MASK                   equ 0020h
CANCON_R03_REQOP1_POSN                   equ 0006h
CANCON_R03_REQOP1_POSITION               equ 0006h
CANCON_R03_REQOP1_SIZE                   equ 0001h
CANCON_R03_REQOP1_LENGTH                 equ 0001h
CANCON_R03_REQOP1_MASK                   equ 0040h
CANCON_R03_REQOP2_POSN                   equ 0007h
CANCON_R03_REQOP2_POSITION               equ 0007h
CANCON_R03_REQOP2_SIZE                   equ 0001h
CANCON_R03_REQOP2_LENGTH                 equ 0001h
CANCON_R03_REQOP2_MASK                   equ 0080h
CANCON_R03_FP1_POSN                      equ 0001h
CANCON_R03_FP1_POSITION                  equ 0001h
CANCON_R03_FP1_SIZE                      equ 0001h
CANCON_R03_FP1_LENGTH                    equ 0001h
CANCON_R03_FP1_MASK                      equ 0002h
CANCON_R03_FP2_POSN                      equ 0002h
CANCON_R03_FP2_POSITION                  equ 0002h
CANCON_R03_FP2_SIZE                      equ 0001h
CANCON_R03_FP2_LENGTH                    equ 0001h
CANCON_R03_FP2_MASK                      equ 0004h
CANCON_R03_FP3_POSN                      equ 0003h
CANCON_R03_FP3_POSITION                  equ 0003h
CANCON_R03_FP3_SIZE                      equ 0001h
CANCON_R03_FP3_LENGTH                    equ 0001h
CANCON_R03_FP3_MASK                      equ 0008h
CANCON_R03_WIN_POSN                      equ 0001h
CANCON_R03_WIN_POSITION                  equ 0001h
CANCON_R03_WIN_SIZE                      equ 0003h
CANCON_R03_WIN_LENGTH                    equ 0003h
CANCON_R03_WIN_MASK                      equ 000Eh
CANCON_R03_FP_POSN                       equ 0000h
CANCON_R03_FP_POSITION                   equ 0000h
CANCON_R03_FP_SIZE                       equ 0004h
CANCON_R03_FP_LENGTH                     equ 0004h
CANCON_R03_FP_MASK                       equ 000Fh

// Register: TXB1CON
#define TXB1CON TXB1CON
TXB1CON                                  equ 037D0h
// bitfield definitions
TXB1CON_TXPRI_POSN                       equ 0000h
TXB1CON_TXPRI_POSITION                   equ 0000h
TXB1CON_TXPRI_SIZE                       equ 0002h
TXB1CON_TXPRI_LENGTH                     equ 0002h
TXB1CON_TXPRI_MASK                       equ 0003h
TXB1CON_TXREQ_POSN                       equ 0003h
TXB1CON_TXREQ_POSITION                   equ 0003h
TXB1CON_TXREQ_SIZE                       equ 0001h
TXB1CON_TXREQ_LENGTH                     equ 0001h
TXB1CON_TXREQ_MASK                       equ 0008h
TXB1CON_TXERR_POSN                       equ 0004h
TXB1CON_TXERR_POSITION                   equ 0004h
TXB1CON_TXERR_SIZE                       equ 0001h
TXB1CON_TXERR_LENGTH                     equ 0001h
TXB1CON_TXERR_MASK                       equ 0010h
TXB1CON_TXLARB_POSN                      equ 0005h
TXB1CON_TXLARB_POSITION                  equ 0005h
TXB1CON_TXLARB_SIZE                      equ 0001h
TXB1CON_TXLARB_LENGTH                    equ 0001h
TXB1CON_TXLARB_MASK                      equ 0020h
TXB1CON_TXABT_POSN                       equ 0006h
TXB1CON_TXABT_POSITION                   equ 0006h
TXB1CON_TXABT_SIZE                       equ 0001h
TXB1CON_TXABT_LENGTH                     equ 0001h
TXB1CON_TXABT_MASK                       equ 0040h
TXB1CON_TXBIF_POSN                       equ 0007h
TXB1CON_TXBIF_POSITION                   equ 0007h
TXB1CON_TXBIF_SIZE                       equ 0001h
TXB1CON_TXBIF_LENGTH                     equ 0001h
TXB1CON_TXBIF_MASK                       equ 0080h
TXB1CON_TXPRI0_POSN                      equ 0000h
TXB1CON_TXPRI0_POSITION                  equ 0000h
TXB1CON_TXPRI0_SIZE                      equ 0001h
TXB1CON_TXPRI0_LENGTH                    equ 0001h
TXB1CON_TXPRI0_MASK                      equ 0001h
TXB1CON_TXPRI1_POSN                      equ 0001h
TXB1CON_TXPRI1_POSITION                  equ 0001h
TXB1CON_TXPRI1_SIZE                      equ 0001h
TXB1CON_TXPRI1_LENGTH                    equ 0001h
TXB1CON_TXPRI1_MASK                      equ 0002h

