GopalSaraf/Practicals/PSDL/include/proc/pic18f25k83.inc
// Register: DMA2PR
#define DMA2PR DMA2PR
DMA2PR                                   equ 039F4h
// bitfield definitions
DMA2PR_PR_POSN                           equ 0000h
DMA2PR_PR_POSITION                       equ 0000h
DMA2PR_PR_SIZE                           equ 0003h
DMA2PR_PR_LENGTH                         equ 0003h
DMA2PR_PR_MASK                           equ 0007h
DMA2PR_PR0_POSN                          equ 0000h
DMA2PR_PR0_POSITION                      equ 0000h
DMA2PR_PR0_SIZE                          equ 0001h
DMA2PR_PR0_LENGTH                        equ 0001h
DMA2PR_PR0_MASK                          equ 0001h
DMA2PR_PR1_POSN                          equ 0001h
DMA2PR_PR1_POSITION                      equ 0001h
DMA2PR_PR1_SIZE                          equ 0001h
DMA2PR_PR1_LENGTH                        equ 0001h
DMA2PR_PR1_MASK                          equ 0002h
DMA2PR_PR2_POSN                          equ 0002h
DMA2PR_PR2_POSITION                      equ 0002h
DMA2PR_PR2_SIZE                          equ 0001h
DMA2PR_PR2_LENGTH                        equ 0001h
DMA2PR_PR2_MASK                          equ 0004h
DMA2PR_DMA2PR_POSN                       equ 0000h
DMA2PR_DMA2PR_POSITION                   equ 0000h
DMA2PR_DMA2PR_SIZE                       equ 0003h
DMA2PR_DMA2PR_LENGTH                     equ 0003h
DMA2PR_DMA2PR_MASK                       equ 0007h
DMA2PR_DMA2PR0_POSN                      equ 0000h
DMA2PR_DMA2PR0_POSITION                  equ 0000h
DMA2PR_DMA2PR0_SIZE                      equ 0001h
DMA2PR_DMA2PR0_LENGTH                    equ 0001h
DMA2PR_DMA2PR0_MASK                      equ 0001h
DMA2PR_DMA2PR1_POSN                      equ 0001h
DMA2PR_DMA2PR1_POSITION                  equ 0001h
DMA2PR_DMA2PR1_SIZE                      equ 0001h
DMA2PR_DMA2PR1_LENGTH                    equ 0001h
DMA2PR_DMA2PR1_MASK                      equ 0002h
DMA2PR_DMA2PR2_POSN                      equ 0002h
DMA2PR_DMA2PR2_POSITION                  equ 0002h
DMA2PR_DMA2PR2_SIZE                      equ 0001h
DMA2PR_DMA2PR2_LENGTH                    equ 0001h
DMA2PR_DMA2PR2_MASK                      equ 0004h

// Register: SCANPR
#define SCANPR SCANPR
SCANPR                                   equ 039F7h
// bitfield definitions
SCANPR_PR_POSN                           equ 0000h
SCANPR_PR_POSITION                       equ 0000h
SCANPR_PR_SIZE                           equ 0003h
SCANPR_PR_LENGTH                         equ 0003h
SCANPR_PR_MASK                           equ 0007h
SCANPR_PR0_POSN                          equ 0000h
SCANPR_PR0_POSITION                      equ 0000h
SCANPR_PR0_SIZE                          equ 0001h
SCANPR_PR0_LENGTH                        equ 0001h
SCANPR_PR0_MASK                          equ 0001h
SCANPR_PR1_POSN                          equ 0001h
SCANPR_PR1_POSITION                      equ 0001h
SCANPR_PR1_SIZE                          equ 0001h
SCANPR_PR1_LENGTH                        equ 0001h
SCANPR_PR1_MASK                          equ 0002h
SCANPR_PR2_POSN                          equ 0002h
SCANPR_PR2_POSITION                      equ 0002h
SCANPR_PR2_SIZE                          equ 0001h
SCANPR_PR2_LENGTH                        equ 0001h
SCANPR_PR2_MASK                          equ 0004h
SCANPR_SCANPR_POSN                       equ 0000h
SCANPR_SCANPR_POSITION                   equ 0000h
SCANPR_SCANPR_SIZE                       equ 0003h
SCANPR_SCANPR_LENGTH                     equ 0003h
SCANPR_SCANPR_MASK                       equ 0007h
SCANPR_SCANPR0_POSN                      equ 0000h
SCANPR_SCANPR0_POSITION                  equ 0000h
SCANPR_SCANPR0_SIZE                      equ 0001h
SCANPR_SCANPR0_LENGTH                    equ 0001h
SCANPR_SCANPR0_MASK                      equ 0001h
SCANPR_SCANPR1_POSN                      equ 0001h
SCANPR_SCANPR1_POSITION                  equ 0001h
SCANPR_SCANPR1_SIZE                      equ 0001h
SCANPR_SCANPR1_LENGTH                    equ 0001h
SCANPR_SCANPR1_MASK                      equ 0002h
SCANPR_SCANPR2_POSN                      equ 0002h
SCANPR_SCANPR2_POSITION                  equ 0002h
SCANPR_SCANPR2_SIZE                      equ 0001h
SCANPR_SCANPR2_LENGTH                    equ 0001h
SCANPR_SCANPR2_MASK                      equ 0004h

// Register: RA0PPS
#define RA0PPS RA0PPS
RA0PPS                                   equ 03A00h
// bitfield definitions
RA0PPS_RA0PPS0_POSN                      equ 0000h
RA0PPS_RA0PPS0_POSITION                  equ 0000h
RA0PPS_RA0PPS0_SIZE                      equ 0001h
RA0PPS_RA0PPS0_LENGTH                    equ 0001h
RA0PPS_RA0PPS0_MASK                      equ 0001h
RA0PPS_RA0PPS1_POSN                      equ 0001h
RA0PPS_RA0PPS1_POSITION                  equ 0001h
RA0PPS_RA0PPS1_SIZE                      equ 0001h
RA0PPS_RA0PPS1_LENGTH                    equ 0001h
RA0PPS_RA0PPS1_MASK                      equ 0002h
RA0PPS_RA0PPS2_POSN                      equ 0002h
RA0PPS_RA0PPS2_POSITION                  equ 0002h
RA0PPS_RA0PPS2_SIZE                      equ 0001h
RA0PPS_RA0PPS2_LENGTH                    equ 0001h
RA0PPS_RA0PPS2_MASK                      equ 0004h
RA0PPS_RA0PPS3_POSN                      equ 0003h
RA0PPS_RA0PPS3_POSITION                  equ 0003h
RA0PPS_RA0PPS3_SIZE                      equ 0001h
RA0PPS_RA0PPS3_LENGTH                    equ 0001h
RA0PPS_RA0PPS3_MASK                      equ 0008h
RA0PPS_RA0PPS4_POSN                      equ 0004h
RA0PPS_RA0PPS4_POSITION                  equ 0004h
RA0PPS_RA0PPS4_SIZE                      equ 0001h
RA0PPS_RA0PPS4_LENGTH                    equ 0001h
RA0PPS_RA0PPS4_MASK                      equ 0010h
RA0PPS_RA0PPS5_POSN                      equ 0005h
RA0PPS_RA0PPS5_POSITION                  equ 0005h
RA0PPS_RA0PPS5_SIZE                      equ 0001h
RA0PPS_RA0PPS5_LENGTH                    equ 0001h
RA0PPS_RA0PPS5_MASK                      equ 0020h

// Register: RA1PPS
#define RA1PPS RA1PPS
RA1PPS                                   equ 03A01h
// bitfield definitions
RA1PPS_RA1PPS0_POSN                      equ 0000h
RA1PPS_RA1PPS0_POSITION                  equ 0000h
RA1PPS_RA1PPS0_SIZE                      equ 0001h
RA1PPS_RA1PPS0_LENGTH                    equ 0001h
RA1PPS_RA1PPS0_MASK                      equ 0001h
RA1PPS_RA1PPS1_POSN                      equ 0001h
RA1PPS_RA1PPS1_POSITION                  equ 0001h
RA1PPS_RA1PPS1_SIZE                      equ 0001h
RA1PPS_RA1PPS1_LENGTH                    equ 0001h
RA1PPS_RA1PPS1_MASK                      equ 0002h
RA1PPS_RA1PPS2_POSN                      equ 0002h
RA1PPS_RA1PPS2_POSITION                  equ 0002h
RA1PPS_RA1PPS2_SIZE                      equ 0001h
RA1PPS_RA1PPS2_LENGTH                    equ 0001h
RA1PPS_RA1PPS2_MASK                      equ 0004h
RA1PPS_RA1PPS3_POSN                      equ 0003h
RA1PPS_RA1PPS3_POSITION                  equ 0003h
RA1PPS_RA1PPS3_SIZE                      equ 0001h
RA1PPS_RA1PPS3_LENGTH                    equ 0001h
RA1PPS_RA1PPS3_MASK                      equ 0008h
RA1PPS_RA1PPS4_POSN                      equ 0004h
RA1PPS_RA1PPS4_POSITION                  equ 0004h
RA1PPS_RA1PPS4_SIZE                      equ 0001h
RA1PPS_RA1PPS4_LENGTH                    equ 0001h
RA1PPS_RA1PPS4_MASK                      equ 0010h
RA1PPS_RA1PPS5_POSN                      equ 0005h
RA1PPS_RA1PPS5_POSITION                  equ 0005h
RA1PPS_RA1PPS5_SIZE                      equ 0001h
RA1PPS_RA1PPS5_LENGTH                    equ 0001h
RA1PPS_RA1PPS5_MASK                      equ 0020h

// Register: RA2PPS
#define RA2PPS RA2PPS
RA2PPS                                   equ 03A02h
// bitfield definitions
RA2PPS_RA2PPS0_POSN                      equ 0000h
RA2PPS_RA2PPS0_POSITION                  equ 0000h
RA2PPS_RA2PPS0_SIZE                      equ 0001h
RA2PPS_RA2PPS0_LENGTH                    equ 0001h
RA2PPS_RA2PPS0_MASK                      equ 0001h
RA2PPS_RA2PPS1_POSN                      equ 0001h
RA2PPS_RA2PPS1_POSITION                  equ 0001h
RA2PPS_RA2PPS1_SIZE                      equ 0001h
RA2PPS_RA2PPS1_LENGTH                    equ 0001h
RA2PPS_RA2PPS1_MASK                      equ 0002h
RA2PPS_RA2PPS2_POSN                      equ 0002h
RA2PPS_RA2PPS2_POSITION                  equ 0002h
RA2PPS_RA2PPS2_SIZE                      equ 0001h
RA2PPS_RA2PPS2_LENGTH                    equ 0001h
RA2PPS_RA2PPS2_MASK                      equ 0004h
RA2PPS_RA2PPS3_POSN                      equ 0003h
RA2PPS_RA2PPS3_POSITION                  equ 0003h
RA2PPS_RA2PPS3_SIZE                      equ 0001h
RA2PPS_RA2PPS3_LENGTH                    equ 0001h
RA2PPS_RA2PPS3_MASK                      equ 0008h
RA2PPS_RA2PPS4_POSN                      equ 0004h
RA2PPS_RA2PPS4_POSITION                  equ 0004h
RA2PPS_RA2PPS4_SIZE                      equ 0001h
RA2PPS_RA2PPS4_LENGTH                    equ 0001h
RA2PPS_RA2PPS4_MASK                      equ 0010h
RA2PPS_RA2PPS5_POSN                      equ 0005h
RA2PPS_RA2PPS5_POSITION                  equ 0005h
RA2PPS_RA2PPS5_SIZE                      equ 0001h
RA2PPS_RA2PPS5_LENGTH                    equ 0001h
RA2PPS_RA2PPS5_MASK                      equ 0020h

