GopalSaraf/Practicals/PSDL/include/proc/pic18f25k83.inc
// Register: U2FIFO
#define U2FIFO U2FIFO
U2FIFO                                   equ 03DDFh
// bitfield definitions
U2FIFO_RXBF_POSN                         equ 0000h
U2FIFO_RXBF_POSITION                     equ 0000h
U2FIFO_RXBF_SIZE                         equ 0001h
U2FIFO_RXBF_LENGTH                       equ 0001h
U2FIFO_RXBF_MASK                         equ 0001h
U2FIFO_RXBE_POSN                         equ 0001h
U2FIFO_RXBE_POSITION                     equ 0001h
U2FIFO_RXBE_SIZE                         equ 0001h
U2FIFO_RXBE_LENGTH                       equ 0001h
U2FIFO_RXBE_MASK                         equ 0002h
U2FIFO_XON_POSN                          equ 0002h
U2FIFO_XON_POSITION                      equ 0002h
U2FIFO_XON_SIZE                          equ 0001h
U2FIFO_XON_LENGTH                        equ 0001h
U2FIFO_XON_MASK                          equ 0004h
U2FIFO_RXIDL_POSN                        equ 0003h
U2FIFO_RXIDL_POSITION                    equ 0003h
U2FIFO_RXIDL_SIZE                        equ 0001h
U2FIFO_RXIDL_LENGTH                      equ 0001h
U2FIFO_RXIDL_MASK                        equ 0008h
U2FIFO_TXBF_POSN                         equ 0004h
U2FIFO_TXBF_POSITION                     equ 0004h
U2FIFO_TXBF_SIZE                         equ 0001h
U2FIFO_TXBF_LENGTH                       equ 0001h
U2FIFO_TXBF_MASK                         equ 0010h
U2FIFO_TXBE_POSN                         equ 0005h
U2FIFO_TXBE_POSITION                     equ 0005h
U2FIFO_TXBE_SIZE                         equ 0001h
U2FIFO_TXBE_LENGTH                       equ 0001h
U2FIFO_TXBE_MASK                         equ 0020h
U2FIFO_STPMD_POSN                        equ 0006h
U2FIFO_STPMD_POSITION                    equ 0006h
U2FIFO_STPMD_SIZE                        equ 0001h
U2FIFO_STPMD_LENGTH                      equ 0001h
U2FIFO_STPMD_MASK                        equ 0040h
U2FIFO_TXWRE_POSN                        equ 0007h
U2FIFO_TXWRE_POSITION                    equ 0007h
U2FIFO_TXWRE_SIZE                        equ 0001h
U2FIFO_TXWRE_LENGTH                      equ 0001h
U2FIFO_TXWRE_MASK                        equ 0080h
U2FIFO_U2RXBF_POSN                       equ 0000h
U2FIFO_U2RXBF_POSITION                   equ 0000h
U2FIFO_U2RXBF_SIZE                       equ 0001h
U2FIFO_U2RXBF_LENGTH                     equ 0001h
U2FIFO_U2RXBF_MASK                       equ 0001h
U2FIFO_U2RXBE_POSN                       equ 0001h
U2FIFO_U2RXBE_POSITION                   equ 0001h
U2FIFO_U2RXBE_SIZE                       equ 0001h
U2FIFO_U2RXBE_LENGTH                     equ 0001h
U2FIFO_U2RXBE_MASK                       equ 0002h
U2FIFO_U2XON_POSN                        equ 0002h
U2FIFO_U2XON_POSITION                    equ 0002h
U2FIFO_U2XON_SIZE                        equ 0001h
U2FIFO_U2XON_LENGTH                      equ 0001h
U2FIFO_U2XON_MASK                        equ 0004h
U2FIFO_U2RXIDL_POSN                      equ 0003h
U2FIFO_U2RXIDL_POSITION                  equ 0003h
U2FIFO_U2RXIDL_SIZE                      equ 0001h
U2FIFO_U2RXIDL_LENGTH                    equ 0001h
U2FIFO_U2RXIDL_MASK                      equ 0008h
U2FIFO_U2TXBF_POSN                       equ 0004h
U2FIFO_U2TXBF_POSITION                   equ 0004h
U2FIFO_U2TXBF_SIZE                       equ 0001h
U2FIFO_U2TXBF_LENGTH                     equ 0001h
U2FIFO_U2TXBF_MASK                       equ 0010h
U2FIFO_U2TXBE_POSN                       equ 0005h
U2FIFO_U2TXBE_POSITION                   equ 0005h
U2FIFO_U2TXBE_SIZE                       equ 0001h
U2FIFO_U2TXBE_LENGTH                     equ 0001h
U2FIFO_U2TXBE_MASK                       equ 0020h
U2FIFO_U2STPMD_POSN                      equ 0006h
U2FIFO_U2STPMD_POSITION                  equ 0006h
U2FIFO_U2STPMD_SIZE                      equ 0001h
U2FIFO_U2STPMD_LENGTH                    equ 0001h
U2FIFO_U2STPMD_MASK                      equ 0040h
U2FIFO_U2TXWRE_POSN                      equ 0007h
U2FIFO_U2TXWRE_POSITION                  equ 0007h
U2FIFO_U2TXWRE_SIZE                      equ 0001h
U2FIFO_U2TXWRE_LENGTH                    equ 0001h
U2FIFO_U2TXWRE_MASK                      equ 0080h
U2FIFO_U2RCIDL_POSN                      equ 0003h
U2FIFO_U2RCIDL_POSITION                  equ 0003h
U2FIFO_U2RCIDL_SIZE                      equ 0001h
U2FIFO_U2RCIDL_LENGTH                    equ 0001h
U2FIFO_U2RCIDL_MASK                      equ 0008h
U2FIFO_RCIDL_POSN                        equ 0003h
U2FIFO_RCIDL_POSITION                    equ 0003h
U2FIFO_RCIDL_SIZE                        equ 0001h
U2FIFO_RCIDL_LENGTH                      equ 0001h
U2FIFO_RCIDL_MASK                        equ 0008h

// Register: U2UIR
#define U2UIR U2UIR
U2UIR                                    equ 03DE0h
// bitfield definitions
U2UIR_ABDIE_POSN                         equ 0002h
U2UIR_ABDIE_POSITION                     equ 0002h
U2UIR_ABDIE_SIZE                         equ 0001h
U2UIR_ABDIE_LENGTH                       equ 0001h
U2UIR_ABDIE_MASK                         equ 0004h
U2UIR_ABDIF_POSN                         equ 0006h
U2UIR_ABDIF_POSITION                     equ 0006h
U2UIR_ABDIF_SIZE                         equ 0001h
U2UIR_ABDIF_LENGTH                       equ 0001h
U2UIR_ABDIF_MASK                         equ 0040h
U2UIR_WUIF_POSN                          equ 0007h
U2UIR_WUIF_POSITION                      equ 0007h
U2UIR_WUIF_SIZE                          equ 0001h
U2UIR_WUIF_LENGTH                        equ 0001h
U2UIR_WUIF_MASK                          equ 0080h
U2UIR_U2ABDIE_POSN                       equ 0002h
U2UIR_U2ABDIE_POSITION                   equ 0002h
U2UIR_U2ABDIE_SIZE                       equ 0001h
U2UIR_U2ABDIE_LENGTH                     equ 0001h
U2UIR_U2ABDIE_MASK                       equ 0004h
U2UIR_U2ABDIF_POSN                       equ 0006h
U2UIR_U2ABDIF_POSITION                   equ 0006h
U2UIR_U2ABDIF_SIZE                       equ 0001h
U2UIR_U2ABDIF_LENGTH                     equ 0001h
U2UIR_U2ABDIF_MASK                       equ 0040h
U2UIR_U2WUIF_POSN                        equ 0007h
U2UIR_U2WUIF_POSITION                    equ 0007h
U2UIR_U2WUIF_SIZE                        equ 0001h
U2UIR_U2WUIF_LENGTH                      equ 0001h
U2UIR_U2WUIF_MASK                        equ 0080h

// Register: U2ERRIR
#define U2ERRIR U2ERRIR
U2ERRIR                                  equ 03DE1h
// bitfield definitions
U2ERRIR_TXCIF_POSN                       equ 0000h
U2ERRIR_TXCIF_POSITION                   equ 0000h
U2ERRIR_TXCIF_SIZE                       equ 0001h
U2ERRIR_TXCIF_LENGTH                     equ 0001h
U2ERRIR_TXCIF_MASK                       equ 0001h
U2ERRIR_RXFOIF_POSN                      equ 0001h
U2ERRIR_RXFOIF_POSITION                  equ 0001h
U2ERRIR_RXFOIF_SIZE                      equ 0001h
U2ERRIR_RXFOIF_LENGTH                    equ 0001h
U2ERRIR_RXFOIF_MASK                      equ 0002h
U2ERRIR_RXBKIF_POSN                      equ 0002h
U2ERRIR_RXBKIF_POSITION                  equ 0002h
U2ERRIR_RXBKIF_SIZE                      equ 0001h
U2ERRIR_RXBKIF_LENGTH                    equ 0001h
U2ERRIR_RXBKIF_MASK                      equ 0004h
U2ERRIR_FERIF_POSN                       equ 0003h
U2ERRIR_FERIF_POSITION                   equ 0003h
U2ERRIR_FERIF_SIZE                       equ 0001h
U2ERRIR_FERIF_LENGTH                     equ 0001h
U2ERRIR_FERIF_MASK                       equ 0008h
U2ERRIR_CERIF_POSN                       equ 0004h
U2ERRIR_CERIF_POSITION                   equ 0004h
U2ERRIR_CERIF_SIZE                       equ 0001h
U2ERRIR_CERIF_LENGTH                     equ 0001h
U2ERRIR_CERIF_MASK                       equ 0010h
U2ERRIR_ABDOVF_POSN                      equ 0005h
U2ERRIR_ABDOVF_POSITION                  equ 0005h
U2ERRIR_ABDOVF_SIZE                      equ 0001h
U2ERRIR_ABDOVF_LENGTH                    equ 0001h
U2ERRIR_ABDOVF_MASK                      equ 0020h
U2ERRIR_PERIF_POSN                       equ 0006h
U2ERRIR_PERIF_POSITION                   equ 0006h
U2ERRIR_PERIF_SIZE                       equ 0001h
U2ERRIR_PERIF_LENGTH                     equ 0001h
U2ERRIR_PERIF_MASK                       equ 0040h
U2ERRIR_TXMTIF_POSN                      equ 0007h
U2ERRIR_TXMTIF_POSITION                  equ 0007h
U2ERRIR_TXMTIF_SIZE                      equ 0001h
U2ERRIR_TXMTIF_LENGTH                    equ 0001h
U2ERRIR_TXMTIF_MASK                      equ 0080h
U2ERRIR_U2TXCIF_POSN                     equ 0000h
U2ERRIR_U2TXCIF_POSITION                 equ 0000h
U2ERRIR_U2TXCIF_SIZE                     equ 0001h
U2ERRIR_U2TXCIF_LENGTH                   equ 0001h
U2ERRIR_U2TXCIF_MASK                     equ 0001h
U2ERRIR_U2RXFOIF_POSN                    equ 0001h
U2ERRIR_U2RXFOIF_POSITION                equ 0001h
U2ERRIR_U2RXFOIF_SIZE                    equ 0001h
U2ERRIR_U2RXFOIF_LENGTH                  equ 0001h
U2ERRIR_U2RXFOIF_MASK                    equ 0002h
U2ERRIR_U2RXBKIF_POSN                    equ 0002h
U2ERRIR_U2RXBKIF_POSITION                equ 0002h
U2ERRIR_U2RXBKIF_SIZE                    equ 0001h
U2ERRIR_U2RXBKIF_LENGTH                  equ 0001h
U2ERRIR_U2RXBKIF_MASK                    equ 0004h
U2ERRIR_U2FERIF_POSN                     equ 0003h
U2ERRIR_U2FERIF_POSITION                 equ 0003h
U2ERRIR_U2FERIF_SIZE                     equ 0001h
U2ERRIR_U2FERIF_LENGTH                   equ 0001h
U2ERRIR_U2FERIF_MASK                     equ 0008h
U2ERRIR_U2CERIF_POSN                     equ 0004h
U2ERRIR_U2CERIF_POSITION                 equ 0004h
U2ERRIR_U2CERIF_SIZE                     equ 0001h
U2ERRIR_U2CERIF_LENGTH                   equ 0001h
U2ERRIR_U2CERIF_MASK                     equ 0010h
U2ERRIR_U2ABDOVF_POSN                    equ 0005h
U2ERRIR_U2ABDOVF_POSITION                equ 0005h
U2ERRIR_U2ABDOVF_SIZE                    equ 0001h
U2ERRIR_U2ABDOVF_LENGTH                  equ 0001h
U2ERRIR_U2ABDOVF_MASK                    equ 0020h
U2ERRIR_U2PERIF_POSN                     equ 0006h
U2ERRIR_U2PERIF_POSITION                 equ 0006h
U2ERRIR_U2PERIF_SIZE                     equ 0001h
U2ERRIR_U2PERIF_LENGTH                   equ 0001h
U2ERRIR_U2PERIF_MASK                     equ 0040h
U2ERRIR_U2TXMTIF_POSN                    equ 0007h
U2ERRIR_U2TXMTIF_POSITION                equ 0007h
U2ERRIR_U2TXMTIF_SIZE                    equ 0001h
U2ERRIR_U2TXMTIF_LENGTH                  equ 0001h
U2ERRIR_U2TXMTIF_MASK                    equ 0080h

// Register: U2ERRIE
#define U2ERRIE U2ERRIE
U2ERRIE                                  equ 03DE2h
// bitfield definitions
U2ERRIE_TXCIE_POSN                       equ 0000h
U2ERRIE_TXCIE_POSITION                   equ 0000h
U2ERRIE_TXCIE_SIZE                       equ 0001h
U2ERRIE_TXCIE_LENGTH                     equ 0001h
U2ERRIE_TXCIE_MASK                       equ 0001h
U2ERRIE_RXFOIE_POSN                      equ 0001h
U2ERRIE_RXFOIE_POSITION                  equ 0001h
U2ERRIE_RXFOIE_SIZE                      equ 0001h
U2ERRIE_RXFOIE_LENGTH                    equ 0001h
U2ERRIE_RXFOIE_MASK                      equ 0002h
U2ERRIE_RXBKIE_POSN                      equ 0002h
U2ERRIE_RXBKIE_POSITION                  equ 0002h
U2ERRIE_RXBKIE_SIZE                      equ 0001h
U2ERRIE_RXBKIE_LENGTH                    equ 0001h
U2ERRIE_RXBKIE_MASK                      equ 0004h
U2ERRIE_FERIE_POSN                       equ 0003h
U2ERRIE_FERIE_POSITION                   equ 0003h
U2ERRIE_FERIE_SIZE                       equ 0001h
U2ERRIE_FERIE_LENGTH                     equ 0001h
U2ERRIE_FERIE_MASK                       equ 0008h
U2ERRIE_CERIE_POSN                       equ 0004h
U2ERRIE_CERIE_POSITION                   equ 0004h
U2ERRIE_CERIE_SIZE                       equ 0001h
U2ERRIE_CERIE_LENGTH                     equ 0001h
U2ERRIE_CERIE_MASK                       equ 0010h
U2ERRIE_ABDOVE_POSN                      equ 0005h
U2ERRIE_ABDOVE_POSITION                  equ 0005h
U2ERRIE_ABDOVE_SIZE                      equ 0001h
U2ERRIE_ABDOVE_LENGTH                    equ 0001h
U2ERRIE_ABDOVE_MASK                      equ 0020h
U2ERRIE_PERIE_POSN                       equ 0006h
U2ERRIE_PERIE_POSITION                   equ 0006h
U2ERRIE_PERIE_SIZE                       equ 0001h
U2ERRIE_PERIE_LENGTH                     equ 0001h
U2ERRIE_PERIE_MASK                       equ 0040h
U2ERRIE_TXMTIE_POSN                      equ 0007h
U2ERRIE_TXMTIE_POSITION                  equ 0007h
U2ERRIE_TXMTIE_SIZE                      equ 0001h
U2ERRIE_TXMTIE_LENGTH                    equ 0001h
U2ERRIE_TXMTIE_MASK                      equ 0080h
U2ERRIE_U2TXCIE_POSN                     equ 0000h
U2ERRIE_U2TXCIE_POSITION                 equ 0000h
U2ERRIE_U2TXCIE_SIZE                     equ 0001h
U2ERRIE_U2TXCIE_LENGTH                   equ 0001h
U2ERRIE_U2TXCIE_MASK                     equ 0001h
U2ERRIE_U2RXFOIE_POSN                    equ 0001h
U2ERRIE_U2RXFOIE_POSITION                equ 0001h
U2ERRIE_U2RXFOIE_SIZE                    equ 0001h
U2ERRIE_U2RXFOIE_LENGTH                  equ 0001h
U2ERRIE_U2RXFOIE_MASK                    equ 0002h
U2ERRIE_U2RXBKIE_POSN                    equ 0002h
U2ERRIE_U2RXBKIE_POSITION                equ 0002h
U2ERRIE_U2RXBKIE_SIZE                    equ 0001h
U2ERRIE_U2RXBKIE_LENGTH                  equ 0001h
U2ERRIE_U2RXBKIE_MASK                    equ 0004h
U2ERRIE_U2FERIE_POSN                     equ 0003h
U2ERRIE_U2FERIE_POSITION                 equ 0003h
U2ERRIE_U2FERIE_SIZE                     equ 0001h
U2ERRIE_U2FERIE_LENGTH                   equ 0001h
U2ERRIE_U2FERIE_MASK                     equ 0008h
U2ERRIE_U2CERIE_POSN                     equ 0004h
U2ERRIE_U2CERIE_POSITION                 equ 0004h
U2ERRIE_U2CERIE_SIZE                     equ 0001h
U2ERRIE_U2CERIE_LENGTH                   equ 0001h
U2ERRIE_U2CERIE_MASK                     equ 0010h
U2ERRIE_U2ABDOVE_POSN                    equ 0005h
U2ERRIE_U2ABDOVE_POSITION                equ 0005h
U2ERRIE_U2ABDOVE_SIZE                    equ 0001h
U2ERRIE_U2ABDOVE_LENGTH                  equ 0001h
U2ERRIE_U2ABDOVE_MASK                    equ 0020h
U2ERRIE_U2PERIE_POSN                     equ 0006h
U2ERRIE_U2PERIE_POSITION                 equ 0006h
U2ERRIE_U2PERIE_SIZE                     equ 0001h
U2ERRIE_U2PERIE_LENGTH                   equ 0001h
U2ERRIE_U2PERIE_MASK                     equ 0040h
U2ERRIE_U2TXMTIE_POSN                    equ 0007h
U2ERRIE_U2TXMTIE_POSITION                equ 0007h
U2ERRIE_U2TXMTIE_SIZE                    equ 0001h
U2ERRIE_U2TXMTIE_LENGTH                  equ 0001h
U2ERRIE_U2TXMTIE_MASK                    equ 0080h

// Register: U1RXB
#define U1RXB U1RXB
U1RXB                                    equ 03DE8h
// bitfield definitions
U1RXB_RXB_POSN                           equ 0000h
U1RXB_RXB_POSITION                       equ 0000h
U1RXB_RXB_SIZE                           equ 0008h
U1RXB_RXB_LENGTH                         equ 0008h
U1RXB_RXB_MASK                           equ 00FFh

