GopalSaraf/Practicals/PSDL/include/proc/pic18f25k83.inc
#define ANSELA3                          BANKMASK(ANSELA), 3, b
#define ANSELA4                          BANKMASK(ANSELA), 4, b
#define ANSELA5                          BANKMASK(ANSELA), 5, b
#define ANSELA6                          BANKMASK(ANSELA), 6, b
#define ANSELA7                          BANKMASK(ANSELA), 7, b
#define ANSELB0                          BANKMASK(ANSELB), 0, b
#define ANSELB1                          BANKMASK(ANSELB), 1, b
#define ANSELB2                          BANKMASK(ANSELB), 2, b
#define ANSELB3                          BANKMASK(ANSELB), 3, b
#define ANSELB4                          BANKMASK(ANSELB), 4, b
#define ANSELB5                          BANKMASK(ANSELB), 5, b
#define ANSELB6                          BANKMASK(ANSELB), 6, b
#define ANSELB7                          BANKMASK(ANSELB), 7, b
#define ANSELC0                          BANKMASK(ANSELC), 0, b
#define ANSELC1                          BANKMASK(ANSELC), 1, b
#define ANSELC2                          BANKMASK(ANSELC), 2, b
#define ANSELC3                          BANKMASK(ANSELC), 3, b
#define ANSELC4                          BANKMASK(ANSELC), 4, b
#define ANSELC5                          BANKMASK(ANSELC), 5, b
#define ANSELC6                          BANKMASK(ANSELC), 6, b
#define ANSELC7                          BANKMASK(ANSELC), 7, b
#define ASYNC                            BANKMASK(T0CON1), 4, a
#define B0D00                            BANKMASK(B0D0), 0, b
#define B0D01                            BANKMASK(B0D0), 1, b
#define B0D02                            BANKMASK(B0D0), 2, b
#define B0D03                            BANKMASK(B0D0), 3, b
#define B0D04                            BANKMASK(B0D0), 4, b
#define B0D05                            BANKMASK(B0D0), 5, b
#define B0D06                            BANKMASK(B0D0), 6, b
#define B0D07                            BANKMASK(B0D0), 7, b
#define B0D10                            BANKMASK(B0D1), 0, b
#define B0D11                            BANKMASK(B0D1), 1, b
#define B0D12                            BANKMASK(B0D1), 2, b
#define B0D13                            BANKMASK(B0D1), 3, b
#define B0D14                            BANKMASK(B0D1), 4, b
#define B0D15                            BANKMASK(B0D1), 5, b
#define B0D16                            BANKMASK(B0D1), 6, b
#define B0D17                            BANKMASK(B0D1), 7, b
#define B0D20                            BANKMASK(B0D2), 0, b
#define B0D21                            BANKMASK(B0D2), 1, b
#define B0D22                            BANKMASK(B0D2), 2, b
#define B0D23                            BANKMASK(B0D2), 3, b
#define B0D24                            BANKMASK(B0D2), 4, b
#define B0D25                            BANKMASK(B0D2), 5, b
#define B0D26                            BANKMASK(B0D2), 6, b
#define B0D27                            BANKMASK(B0D2), 7, b
#define B0D30                            BANKMASK(B0D3), 0, b
#define B0D31                            BANKMASK(B0D3), 1, b
#define B0D32                            BANKMASK(B0D3), 2, b
#define B0D33                            BANKMASK(B0D3), 3, b
#define B0D34                            BANKMASK(B0D3), 4, b
#define B0D35                            BANKMASK(B0D3), 5, b
#define B0D36                            BANKMASK(B0D3), 6, b
#define B0D37                            BANKMASK(B0D3), 7, b
#define B0D40                            BANKMASK(B0D4), 0, b
#define B0D41                            BANKMASK(B0D4), 1, b
#define B0D42                            BANKMASK(B0D4), 2, b
#define B0D43                            BANKMASK(B0D4), 3, b
#define B0D44                            BANKMASK(B0D4), 4, b
#define B0D45                            BANKMASK(B0D4), 5, b
#define B0D46                            BANKMASK(B0D4), 6, b
#define B0D47                            BANKMASK(B0D4), 7, b
#define B0D50                            BANKMASK(B0D5), 0, b
#define B0D51                            BANKMASK(B0D5), 1, b
#define B0D52                            BANKMASK(B0D5), 2, b
#define B0D53                            BANKMASK(B0D5), 3, b
#define B0D54                            BANKMASK(B0D5), 4, b
#define B0D55                            BANKMASK(B0D5), 5, b
#define B0D56                            BANKMASK(B0D5), 6, b
#define B0D57                            BANKMASK(B0D5), 7, b
#define B0D60                            BANKMASK(B0D6), 0, b
#define B0D61                            BANKMASK(B0D6), 1, b
#define B0D62                            BANKMASK(B0D6), 2, b
#define B0D63                            BANKMASK(B0D6), 3, b
#define B0D64                            BANKMASK(B0D6), 4, b
#define B0D65                            BANKMASK(B0D6), 5, b
#define B0D66                            BANKMASK(B0D6), 6, b
#define B0D67                            BANKMASK(B0D6), 7, b
#define B0D70                            BANKMASK(B0D7), 0, b
#define B0D71                            BANKMASK(B0D7), 1, b
#define B0D72                            BANKMASK(B0D7), 2, b
#define B0D73                            BANKMASK(B0D7), 3, b
#define B0D74                            BANKMASK(B0D7), 4, b
#define B0D75                            BANKMASK(B0D7), 5, b
#define B0D76                            BANKMASK(B0D7), 6, b
#define B0D77                            BANKMASK(B0D7), 7, b
#define B0IE                             BANKMASK(BIE0), 2, b
#define B0TXEN                           BANKMASK(BSEL0), 2, b
#define B1D00                            BANKMASK(B1D0), 0, b
#define B1D01                            BANKMASK(B1D0), 1, b
#define B1D02                            BANKMASK(B1D0), 2, b
#define B1D03                            BANKMASK(B1D0), 3, b
#define B1D04                            BANKMASK(B1D0), 4, b
#define B1D05                            BANKMASK(B1D0), 5, b
#define B1D06                            BANKMASK(B1D0), 6, b
#define B1D07                            BANKMASK(B1D0), 7, b
#define B1D10                            BANKMASK(B1D1), 0, b
#define B1D11                            BANKMASK(B1D1), 1, b
#define B1D12                            BANKMASK(B1D1), 2, b
#define B1D13                            BANKMASK(B1D1), 3, b
#define B1D14                            BANKMASK(B1D1), 4, b
#define B1D15                            BANKMASK(B1D1), 5, b
#define B1D16                            BANKMASK(B1D1), 6, b
#define B1D17                            BANKMASK(B1D1), 7, b
#define B1D20                            BANKMASK(B1D2), 0, b
#define B1D21                            BANKMASK(B1D2), 1, b
#define B1D22                            BANKMASK(B1D2), 2, b
#define B1D23                            BANKMASK(B1D2), 3, b
#define B1D24                            BANKMASK(B1D2), 4, b
#define B1D25                            BANKMASK(B1D2), 5, b
#define B1D26                            BANKMASK(B1D2), 6, b
#define B1D27                            BANKMASK(B1D2), 7, b
#define B1D30                            BANKMASK(B1D3), 0, b
#define B1D31                            BANKMASK(B1D3), 1, b
#define B1D32                            BANKMASK(B1D3), 2, b
#define B1D33                            BANKMASK(B1D3), 3, b
#define B1D34                            BANKMASK(B1D3), 4, b
#define B1D35                            BANKMASK(B1D3), 5, b
#define B1D36                            BANKMASK(B1D3), 6, b
#define B1D37                            BANKMASK(B1D3), 7, b
#define B1D40                            BANKMASK(B1D4), 0, b
#define B1D41                            BANKMASK(B1D4), 1, b
#define B1D42                            BANKMASK(B1D4), 2, b
#define B1D43                            BANKMASK(B1D4), 3, b
#define B1D44                            BANKMASK(B1D4), 4, b
#define B1D45                            BANKMASK(B1D4), 5, b
#define B1D46                            BANKMASK(B1D4), 6, b
#define B1D47                            BANKMASK(B1D4), 7, b
#define B1D50                            BANKMASK(B1D5), 0, b
#define B1D51                            BANKMASK(B1D5), 1, b
#define B1D52                            BANKMASK(B1D5), 2, b
#define B1D53                            BANKMASK(B1D5), 3, b
#define B1D54                            BANKMASK(B1D5), 4, b
#define B1D55                            BANKMASK(B1D5), 5, b
#define B1D56                            BANKMASK(B1D5), 6, b
#define B1D57                            BANKMASK(B1D5), 7, b
#define B1D60                            BANKMASK(B1D6), 0, b
#define B1D61                            BANKMASK(B1D6), 1, b
#define B1D62                            BANKMASK(B1D6), 2, b
#define B1D63                            BANKMASK(B1D6), 3, b
#define B1D64                            BANKMASK(B1D6), 4, b
#define B1D65                            BANKMASK(B1D6), 5, b
#define B1D66                            BANKMASK(B1D6), 6, b
#define B1D67                            BANKMASK(B1D6), 7, b
#define B1D70                            BANKMASK(B1D7), 0, b
#define B1D71                            BANKMASK(B1D7), 1, b
#define B1D72                            BANKMASK(B1D7), 2, b
#define B1D73                            BANKMASK(B1D7), 3, b
#define B1D74                            BANKMASK(B1D7), 4, b
#define B1D75                            BANKMASK(B1D7), 5, b
#define B1D76                            BANKMASK(B1D7), 6, b
#define B1D77                            BANKMASK(B1D7), 7, b
#define B1IE                             BANKMASK(BIE0), 3, b
#define B1TXEN                           BANKMASK(BSEL0), 3, b
#define B2D00                            BANKMASK(B2D0), 0, b
#define B2D01                            BANKMASK(B2D0), 1, b
#define B2D02                            BANKMASK(B2D0), 2, b
#define B2D03                            BANKMASK(B2D0), 3, b
#define B2D04                            BANKMASK(B2D0), 4, b
#define B2D05                            BANKMASK(B2D0), 5, b
#define B2D06                            BANKMASK(B2D0), 6, b
#define B2D07                            BANKMASK(B2D0), 7, b
#define B2D10                            BANKMASK(B2D1), 0, b
#define B2D11                            BANKMASK(B2D1), 1, b
#define B2D12                            BANKMASK(B2D1), 2, b
#define B2D13                            BANKMASK(B2D1), 3, b
#define B2D14                            BANKMASK(B2D1), 4, b
#define B2D15                            BANKMASK(B2D1), 5, b
#define B2D16                            BANKMASK(B2D1), 6, b
#define B2D17                            BANKMASK(B2D1), 7, b
#define B2D20                            BANKMASK(B2D2), 0, b
#define B2D21                            BANKMASK(B2D2), 1, b
#define B2D22                            BANKMASK(B2D2), 2, b
#define B2D23                            BANKMASK(B2D2), 3, b
#define B2D24                            BANKMASK(B2D2), 4, b
#define B2D25                            BANKMASK(B2D2), 5, b
#define B2D26                            BANKMASK(B2D2), 6, b
#define B2D27                            BANKMASK(B2D2), 7, b
#define B2D30                            BANKMASK(B2D3), 0, b
#define B2D31                            BANKMASK(B2D3), 1, b
#define B2D32                            BANKMASK(B2D3), 2, b
#define B2D33                            BANKMASK(B2D3), 3, b
#define B2D34                            BANKMASK(B2D3), 4, b
#define B2D35                            BANKMASK(B2D3), 5, b
#define B2D36                            BANKMASK(B2D3), 6, b
#define B2D37                            BANKMASK(B2D3), 7, b
#define B2D40                            BANKMASK(B2D4), 0, b
#define B2D41                            BANKMASK(B2D4), 1, b
#define B2D42                            BANKMASK(B2D4), 2, b
#define B2D43                            BANKMASK(B2D4), 3, b
#define B2D44                            BANKMASK(B2D4), 4, b
#define B2D45                            BANKMASK(B2D4), 5, b
#define B2D46                            BANKMASK(B2D4), 6, b
#define B2D47                            BANKMASK(B2D4), 7, b
#define B2D50                            BANKMASK(B2D5), 0, b
#define B2D51                            BANKMASK(B2D5), 1, b
#define B2D52                            BANKMASK(B2D5), 2, b
#define B2D53                            BANKMASK(B2D5), 3, b
#define B2D54                            BANKMASK(B2D5), 4, b
#define B2D55                            BANKMASK(B2D5), 5, b
#define B2D56                            BANKMASK(B2D5), 6, b
#define B2D57                            BANKMASK(B2D5), 7, b
#define B2D60                            BANKMASK(B2D6), 0, b
#define B2D61                            BANKMASK(B2D6), 1, b
#define B2D62                            BANKMASK(B2D6), 2, b
#define B2D63                            BANKMASK(B2D6), 3, b
#define B2D64                            BANKMASK(B2D6), 4, b
#define B2D65                            BANKMASK(B2D6), 5, b
#define B2D66                            BANKMASK(B2D6), 6, b
#define B2D67                            BANKMASK(B2D6), 7, b
#define B2D70                            BANKMASK(B2D7), 0, b
#define B2D71                            BANKMASK(B2D7), 1, b
#define B2D72                            BANKMASK(B2D7), 2, b
#define B2D73                            BANKMASK(B2D7), 3, b
#define B2D74                            BANKMASK(B2D7), 4, b
#define B2D75                            BANKMASK(B2D7), 5, b
#define B2D76                            BANKMASK(B2D7), 6, b
#define B2D77                            BANKMASK(B2D7), 7, b
#define B2IE                             BANKMASK(BIE0), 4, b
#define B2TXEN                           BANKMASK(BSEL0), 4, b
#define B3D00                            BANKMASK(B3D0), 0, b
#define B3D01                            BANKMASK(B3D0), 1, b
#define B3D02                            BANKMASK(B3D0), 2, b
#define B3D03                            BANKMASK(B3D0), 3, b
#define B3D04                            BANKMASK(B3D0), 4, b
#define B3D05                            BANKMASK(B3D0), 5, b
#define B3D06                            BANKMASK(B3D0), 6, b
#define B3D07                            BANKMASK(B3D0), 7, b
#define B3D10                            BANKMASK(B3D1), 0, b
#define B3D11                            BANKMASK(B3D1), 1, b
#define B3D12                            BANKMASK(B3D1), 2, b
#define B3D13                            BANKMASK(B3D1), 3, b
#define B3D14                            BANKMASK(B3D1), 4, b
#define B3D15                            BANKMASK(B3D1), 5, b
#define B3D16                            BANKMASK(B3D1), 6, b
#define B3D17                            BANKMASK(B3D1), 7, b
#define B3D20                            BANKMASK(B3D2), 0, b
#define B3D21                            BANKMASK(B3D2), 1, b
#define B3D22                            BANKMASK(B3D2), 2, b
#define B3D23                            BANKMASK(B3D2), 3, b
#define B3D24                            BANKMASK(B3D2), 4, b
#define B3D25                            BANKMASK(B3D2), 5, b
#define B3D26                            BANKMASK(B3D2), 6, b
#define B3D27                            BANKMASK(B3D2), 7, b
#define B3D30                            BANKMASK(B3D3), 0, b
#define B3D31                            BANKMASK(B3D3), 1, b
#define B3D32                            BANKMASK(B3D3), 2, b
#define B3D33                            BANKMASK(B3D3), 3, b
#define B3D34                            BANKMASK(B3D3), 4, b
#define B3D35                            BANKMASK(B3D3), 5, b
#define B3D36                            BANKMASK(B3D3), 6, b
#define B3D37                            BANKMASK(B3D3), 7, b
#define B3D40                            BANKMASK(B3D4), 0, b
#define B3D41                            BANKMASK(B3D4), 1, b
#define B3D42                            BANKMASK(B3D4), 2, b
#define B3D43                            BANKMASK(B3D4), 3, b
#define B3D44                            BANKMASK(B3D4), 4, b
#define B3D45                            BANKMASK(B3D4), 5, b
#define B3D46                            BANKMASK(B3D4), 6, b
#define B3D47                            BANKMASK(B3D4), 7, b
#define B3D50                            BANKMASK(B3D5), 0, b
#define B3D51                            BANKMASK(B3D5), 1, b
#define B3D52                            BANKMASK(B3D5), 2, b
#define B3D53                            BANKMASK(B3D5), 3, b
#define B3D54                            BANKMASK(B3D5), 4, b
#define B3D55                            BANKMASK(B3D5), 5, b
#define B3D56                            BANKMASK(B3D5), 6, b
#define B3D57                            BANKMASK(B3D5), 7, b
#define B3D60                            BANKMASK(B3D6), 0, b
#define B3D61                            BANKMASK(B3D6), 1, b
#define B3D62                            BANKMASK(B3D6), 2, b
#define B3D63                            BANKMASK(B3D6), 3, b
#define B3D64                            BANKMASK(B3D6), 4, b
#define B3D65                            BANKMASK(B3D6), 5, b
#define B3D66                            BANKMASK(B3D6), 6, b
#define B3D67                            BANKMASK(B3D6), 7, b
#define B3D70                            BANKMASK(B3D7), 0, b
#define B3D71                            BANKMASK(B3D7), 1, b
#define B3D72                            BANKMASK(B3D7), 2, b
#define B3D73                            BANKMASK(B3D7), 3, b
#define B3D74                            BANKMASK(B3D7), 4, b
#define B3D75                            BANKMASK(B3D7), 5, b
#define B3D76                            BANKMASK(B3D7), 6, b
#define B3D77                            BANKMASK(B3D7), 7, b
#define B3IE                             BANKMASK(BIE0), 5, b
#define B3TXEN                           BANKMASK(BSEL0), 5, b
#define B4D00                            BANKMASK(B4D0), 0, b
#define B4D01                            BANKMASK(B4D0), 1, b
#define B4D02                            BANKMASK(B4D0), 2, b
#define B4D03                            BANKMASK(B4D0), 3, b
#define B4D04                            BANKMASK(B4D0), 4, b
#define B4D05                            BANKMASK(B4D0), 5, b
#define B4D06                            BANKMASK(B4D0), 6, b
#define B4D07                            BANKMASK(B4D0), 7, b
#define B4D10                            BANKMASK(B4D1), 0, b
#define B4D11                            BANKMASK(B4D1), 1, b
#define B4D12                            BANKMASK(B4D1), 2, b
#define B4D13                            BANKMASK(B4D1), 3, b
#define B4D14                            BANKMASK(B4D1), 4, b
#define B4D15                            BANKMASK(B4D1), 5, b
#define B4D16                            BANKMASK(B4D1), 6, b
#define B4D17                            BANKMASK(B4D1), 7, b
#define B4D20                            BANKMASK(B4D2), 0, b
#define B4D21                            BANKMASK(B4D2), 1, b
#define B4D22                            BANKMASK(B4D2), 2, b
#define B4D23                            BANKMASK(B4D2), 3, b
#define B4D24                            BANKMASK(B4D2), 4, b
#define B4D25                            BANKMASK(B4D2), 5, b
#define B4D26                            BANKMASK(B4D2), 6, b
#define B4D27                            BANKMASK(B4D2), 7, b
#define B4D30                            BANKMASK(B4D3), 0, b
#define B4D31                            BANKMASK(B4D3), 1, b
#define B4D32                            BANKMASK(B4D3), 2, b
#define B4D33                            BANKMASK(B4D3), 3, b
#define B4D34                            BANKMASK(B4D3), 4, b
#define B4D35                            BANKMASK(B4D3), 5, b
#define B4D36                            BANKMASK(B4D3), 6, b
#define B4D37                            BANKMASK(B4D3), 7, b
#define B4D40                            BANKMASK(B4D4), 0, b
#define B4D41                            BANKMASK(B4D4), 1, b
#define B4D42                            BANKMASK(B4D4), 2, b
#define B4D43                            BANKMASK(B4D4), 3, b
#define B4D44                            BANKMASK(B4D4), 4, b
#define B4D45                            BANKMASK(B4D4), 5, b
#define B4D46                            BANKMASK(B4D4), 6, b
#define B4D47                            BANKMASK(B4D4), 7, b
#define B4D50                            BANKMASK(B4D5), 0, b
#define B4D51                            BANKMASK(B4D5), 1, b
#define B4D52                            BANKMASK(B4D5), 2, b
#define B4D53                            BANKMASK(B4D5), 3, b
#define B4D54                            BANKMASK(B4D5), 4, b
#define B4D55                            BANKMASK(B4D5), 5, b
#define B4D56                            BANKMASK(B4D5), 6, b
#define B4D57                            BANKMASK(B4D5), 7, b
#define B4D60                            BANKMASK(B4D6), 0, b
#define B4D61                            BANKMASK(B4D6), 1, b
#define B4D62                            BANKMASK(B4D6), 2, b
#define B4D63                            BANKMASK(B4D6), 3, b
#define B4D64                            BANKMASK(B4D6), 4, b
#define B4D65                            BANKMASK(B4D6), 5, b
#define B4D66                            BANKMASK(B4D6), 6, b
#define B4D67                            BANKMASK(B4D6), 7, b
#define B4D70                            BANKMASK(B4D7), 0, b
#define B4D71                            BANKMASK(B4D7), 1, b
#define B4D72                            BANKMASK(B4D7), 2, b
#define B4D73                            BANKMASK(B4D7), 3, b
#define B4D74                            BANKMASK(B4D7), 4, b
#define B4D75                            BANKMASK(B4D7), 5, b
#define B4D76                            BANKMASK(B4D7), 6, b
#define B4D77                            BANKMASK(B4D7), 7, b
#define B4IE                             BANKMASK(BIE0), 6, b
#define B4TXEN                           BANKMASK(BSEL0), 6, b
#define B5D00                            BANKMASK(B5D0), 0, b
#define B5D01                            BANKMASK(B5D0), 1, b
#define B5D02                            BANKMASK(B5D0), 2, b
#define B5D03                            BANKMASK(B5D0), 3, b
#define B5D04                            BANKMASK(B5D0), 4, b
#define B5D05                            BANKMASK(B5D0), 5, b
#define B5D06                            BANKMASK(B5D0), 6, b
#define B5D07                            BANKMASK(B5D0), 7, b
#define B5D10                            BANKMASK(B5D1), 0, b
#define B5D11                            BANKMASK(B5D1), 1, b
#define B5D12                            BANKMASK(B5D1), 2, b
#define B5D13                            BANKMASK(B5D1), 3, b
#define B5D14                            BANKMASK(B5D1), 4, b
#define B5D15                            BANKMASK(B5D1), 5, b
#define B5D16                            BANKMASK(B5D1), 6, b
#define B5D17                            BANKMASK(B5D1), 7, b
#define B5D20                            BANKMASK(B5D2), 0, b
#define B5D21                            BANKMASK(B5D2), 1, b
#define B5D22                            BANKMASK(B5D2), 2, b
#define B5D23                            BANKMASK(B5D2), 3, b
#define B5D24                            BANKMASK(B5D2), 4, b
#define B5D25                            BANKMASK(B5D2), 5, b
#define B5D26                            BANKMASK(B5D2), 6, b
#define B5D27                            BANKMASK(B5D2), 7, b
#define B5D30                            BANKMASK(B5D3), 0, b
#define B5D31                            BANKMASK(B5D3), 1, b
#define B5D32                            BANKMASK(B5D3), 2, b
#define B5D33                            BANKMASK(B5D3), 3, b
#define B5D34                            BANKMASK(B5D3), 4, b
#define B5D35                            BANKMASK(B5D3), 5, b
#define B5D36                            BANKMASK(B5D3), 6, b
#define B5D37                            BANKMASK(B5D3), 7, b
#define B5D40                            BANKMASK(B5D4), 0, b
#define B5D41                            BANKMASK(B5D4), 1, b
