GopalSaraf/Practicals/PSDL/include/proc/pic18f25k83.inc
#define B5D42                            BANKMASK(B5D4), 2, b
#define B5D43                            BANKMASK(B5D4), 3, b
#define B5D44                            BANKMASK(B5D4), 4, b
#define B5D45                            BANKMASK(B5D4), 5, b
#define B5D46                            BANKMASK(B5D4), 6, b
#define B5D47                            BANKMASK(B5D4), 7, b
#define B5D50                            BANKMASK(B5D5), 0, b
#define B5D51                            BANKMASK(B5D5), 1, b
#define B5D52                            BANKMASK(B5D5), 2, b
#define B5D53                            BANKMASK(B5D5), 3, b
#define B5D54                            BANKMASK(B5D5), 4, b
#define B5D55                            BANKMASK(B5D5), 5, b
#define B5D56                            BANKMASK(B5D5), 6, b
#define B5D57                            BANKMASK(B5D5), 7, b
#define B5D60                            BANKMASK(B5D6), 0, b
#define B5D61                            BANKMASK(B5D6), 1, b
#define B5D62                            BANKMASK(B5D6), 2, b
#define B5D63                            BANKMASK(B5D6), 3, b
#define B5D64                            BANKMASK(B5D6), 4, b
#define B5D65                            BANKMASK(B5D6), 5, b
#define B5D66                            BANKMASK(B5D6), 6, b
#define B5D67                            BANKMASK(B5D6), 7, b
#define B5D70                            BANKMASK(B5D7), 0, b
#define B5D71                            BANKMASK(B5D7), 1, b
#define B5D72                            BANKMASK(B5D7), 2, b
#define B5D73                            BANKMASK(B5D7), 3, b
#define B5D74                            BANKMASK(B5D7), 4, b
#define B5D75                            BANKMASK(B5D7), 5, b
#define B5D76                            BANKMASK(B5D7), 6, b
#define B5D77                            BANKMASK(B5D7), 7, b
#define B5IE                             BANKMASK(BIE0), 7, b
#define B5TXEN                           BANKMASK(BSEL0), 7, b
#define BASE0                            BANKMASK(IVTBASEL), 0, a
#define BASE1                            BANKMASK(IVTBASEL), 1, a
#define BASE10                           BANKMASK(IVTBASEH), 2, a
#define BASE11                           BANKMASK(IVTBASEH), 3, a
#define BASE12                           BANKMASK(IVTBASEH), 4, a
#define BASE13                           BANKMASK(IVTBASEH), 5, a
#define BASE14                           BANKMASK(IVTBASEH), 6, a
#define BASE15                           BANKMASK(IVTBASEH), 7, a
#define BASE16                           BANKMASK(IVTBASEU), 0, a
#define BASE17                           BANKMASK(IVTBASEU), 1, a
#define BASE18                           BANKMASK(IVTBASEU), 2, a
#define BASE19                           BANKMASK(IVTBASEU), 3, a
#define BASE2                            BANKMASK(IVTBASEL), 2, a
#define BASE20                           BANKMASK(IVTBASEU), 4, a
#define BASE3                            BANKMASK(IVTBASEL), 3, a
#define BASE4                            BANKMASK(IVTBASEL), 4, a
#define BASE5                            BANKMASK(IVTBASEL), 5, a
#define BASE6                            BANKMASK(IVTBASEL), 6, a
#define BASE7                            BANKMASK(IVTBASEL), 7, a
#define BASE8                            BANKMASK(IVTBASEH), 0, a
#define BASE9                            BANKMASK(IVTBASEH), 1, a
#define BAUD0                            BANKMASK(SPI1BAUD), 0, b
#define BAUD1                            BANKMASK(SPI1BAUD), 1, b
#define BAUD2                            BANKMASK(SPI1BAUD), 2, b
#define BAUD3                            BANKMASK(SPI1BAUD), 3, b
#define BAUD4                            BANKMASK(SPI1BAUD), 4, b
#define BAUD5                            BANKMASK(SPI1BAUD), 5, b
#define BAUD6                            BANKMASK(SPI1BAUD), 6, b
#define BAUD7                            BANKMASK(SPI1BAUD), 7, b
#define BCL1IE                           BANKMASK(I2C1ERR), 1, b
#define BCL1IF                           BANKMASK(I2C1ERR), 5, b
#define BCL2IE                           BANKMASK(I2C2ERR), 1, b
#define BCL2IF                           BANKMASK(I2C2ERR), 5, b
#define BMODE                            BANKMASK(SPI1CON0), 0, b
#define BOR                              BANKMASK(PCON0), 0, a
#define BORRDY                           BANKMASK(BORCON), 0, b
#define BRP0                             BANKMASK(BRGCON1), 0, b
#define BRP1                             BANKMASK(BRGCON1), 1, b
#define BRP2                             BANKMASK(BRGCON1), 2, b
#define BRP3                             BANKMASK(BRGCON1), 3, b
#define BRP4                             BANKMASK(BRGCON1), 4, b
#define BRP5                             BANKMASK(BRGCON1), 5, b
#define BTO1IE                           BANKMASK(I2C1ERR), 2, b
#define BTO1IF                           BANKMASK(I2C1ERR), 6, b
#define BTO2IE                           BANKMASK(I2C2ERR), 2, b
#define BTO2IF                           BANKMASK(I2C2ERR), 6, b
#define BURSTMD                          BANKMASK(SCANCON0), 1, b
#define C1EN                             BANKMASK(CM1CON0), 7, b
#define C1HYS                            BANKMASK(CM1CON0), 1, b
#define C1IE                             BANKMASK(PIE1), 4, b
#define C1IF                             BANKMASK(PIR1), 4, b
#define C1INTN                           BANKMASK(CM1CON1), 0, b
#define C1INTP                           BANKMASK(CM1CON1), 1, b
#define C1IP                             BANKMASK(IPR1), 4, b
#define C1NCH0                           BANKMASK(CM1NCH), 0, b
#define C1NCH1                           BANKMASK(CM1NCH), 1, b
#define C1NCH2                           BANKMASK(CM1NCH), 2, b
#define C1PCH0                           BANKMASK(CM1PCH), 0, b
#define C1PCH1                           BANKMASK(CM1PCH), 1, b
#define C1PCH2                           BANKMASK(CM1PCH), 2, b
#define C1POL                            BANKMASK(CM1CON0), 4, b
#define C1SYNC                           BANKMASK(CM1CON0), 0, b
#define C1TSEL0                          BANKMASK(CCPTMRS0), 0, b
#define C1TSEL1                          BANKMASK(CCPTMRS0), 1, b
#define C2EN                             BANKMASK(CM2CON0), 7, b
#define C2HYS                            BANKMASK(CM2CON0), 1, b
#define C2IE                             BANKMASK(PIE6), 0, b
#define C2IF                             BANKMASK(PIR6), 0, b
#define C2INTN                           BANKMASK(CM2CON1), 0, b
#define C2INTP                           BANKMASK(CM2CON1), 1, b
#define C2IP                             BANKMASK(IPR6), 0, b
#define C2NCH0                           BANKMASK(CM2NCH), 0, b
#define C2NCH1                           BANKMASK(CM2NCH), 1, b
#define C2NCH2                           BANKMASK(CM2NCH), 2, b
#define C2PCH0                           BANKMASK(CM2PCH), 0, b
#define C2PCH1                           BANKMASK(CM2PCH), 1, b
#define C2PCH2                           BANKMASK(CM2PCH), 2, b
#define C2POL                            BANKMASK(CM2CON0), 4, b
#define C2SYNC                           BANKMASK(CM2CON0), 0, b
#define C2TSEL0                          BANKMASK(CCPTMRS0), 2, b
#define C2TSEL1                          BANKMASK(CCPTMRS0), 3, b
#define C3TSEL0                          BANKMASK(CCPTMRS0), 4, b
#define C3TSEL1                          BANKMASK(CCPTMRS0), 5, b
#define C4TSEL0                          BANKMASK(CCPTMRS0), 6, b
#define C4TSEL1                          BANKMASK(CCPTMRS0), 7, b
#define CALC0                            BANKMASK(ADCON3), 4, b
#define CALC1                            BANKMASK(ADCON3), 5, b
#define CALC2                            BANKMASK(ADCON3), 6, b
#define CANMD                            BANKMASK(PMD7), 7, b
#define CAP0                             BANKMASK(ADCAP), 0, b
#define CAP1                             BANKMASK(ADCAP), 1, b
#define CAP2                             BANKMASK(ADCAP), 2, b
#define CAP3                             BANKMASK(ADCAP), 3, b
#define CAP4                             BANKMASK(ADCAP), 4, b
#define CARRY                            BANKMASK(STATUS), 0, a
#define CCH05                            BANKMASK(IPR5), 0, b
#define CCH15                            BANKMASK(IPR5), 1, b
#define CCIP3IP                          BANKMASK(IPR4), 0, b
#define CCP1CTS0                         BANKMASK(CCP1CAP), 0, a
#define CCP1CTS1                         BANKMASK(CCP1CAP), 1, a
#define CCP1CTS2                         BANKMASK(CCP1CAP), 2, a
#define CCP1CTS3                         BANKMASK(CCP1CAP), 3, a
#define CCP1EN                           BANKMASK(CCP1CON), 7, a
#define CCP1FMT                          BANKMASK(CCP1CON), 4, a
#define CCP1IE                           BANKMASK(PIE4), 3, b
#define CCP1IF                           BANKMASK(PIR4), 3, b
#define CCP1IP                           BANKMASK(IPR4), 3, b
#define CCP1MD                           BANKMASK(PMD3), 0, b
#define CCP1MODE0                        BANKMASK(CCP1CON), 0, a
#define CCP1MODE1                        BANKMASK(CCP1CON), 1, a
#define CCP1MODE2                        BANKMASK(CCP1CON), 2, a
#define CCP1MODE3                        BANKMASK(CCP1CON), 3, a
#define CCP1OUT                          BANKMASK(CCP1CON), 5, a
#define CCP2                             BANKMASK(PORTC), 1, a
#define CCP2CTS0                         BANKMASK(CCP2CAP), 0, a
#define CCP2CTS1                         BANKMASK(CCP2CAP), 1, a
#define CCP2CTS2                         BANKMASK(CCP2CAP), 2, a
#define CCP2CTS3                         BANKMASK(CCP2CAP), 3, a
#define CCP2EN                           BANKMASK(CCP2CON), 7, a
#define CCP2FMT                          BANKMASK(CCP2CON), 4, a
#define CCP2IE                           BANKMASK(PIE8), 3, b
#define CCP2IF                           BANKMASK(PIR8), 3, b
#define CCP2IP                           BANKMASK(IPR8), 3, b
#define CCP2MD                           BANKMASK(PMD3), 1, b
#define CCP2MODE0                        BANKMASK(CCP2CON), 0, a
#define CCP2MODE1                        BANKMASK(CCP2CON), 1, a
#define CCP2MODE2                        BANKMASK(CCP2CON), 2, a
#define CCP2MODE3                        BANKMASK(CCP2CON), 3, a
#define CCP2OUT                          BANKMASK(CCP2CON), 5, a
#define CCP2_PA2                         BANKMASK(PORTB), 3, a
#define CCP3CTS0                         BANKMASK(CCP3CAP), 0, a
#define CCP3CTS1                         BANKMASK(CCP3CAP), 1, a
#define CCP3CTS2                         BANKMASK(CCP3CAP), 2, a
#define CCP3CTS3                         BANKMASK(CCP3CAP), 3, a
#define CCP3EN                           BANKMASK(CCP3CON), 7, a
#define CCP3FMT                          BANKMASK(CCP3CON), 4, a
#define CCP3IE                           BANKMASK(PIE9), 2, b
#define CCP3IF                           BANKMASK(PIR9), 2, b
#define CCP3IP                           BANKMASK(IPR9), 2, b
#define CCP3MD                           BANKMASK(PMD3), 2, b
#define CCP3MODE0                        BANKMASK(CCP3CON), 0, a
#define CCP3MODE1                        BANKMASK(CCP3CON), 1, a
#define CCP3MODE2                        BANKMASK(CCP3CON), 2, a
#define CCP3MODE3                        BANKMASK(CCP3CON), 3, a
#define CCP3OUT                          BANKMASK(CCP3CON), 5, a
#define CCP4CTS0                         BANKMASK(CCP4CAP), 0, a
#define CCP4CTS1                         BANKMASK(CCP4CAP), 1, a
#define CCP4CTS2                         BANKMASK(CCP4CAP), 2, a
#define CCP4CTS3                         BANKMASK(CCP4CAP), 3, a
#define CCP4EN                           BANKMASK(CCP4CON), 7, a
#define CCP4FMT                          BANKMASK(CCP4CON), 4, a
#define CCP4IE                           BANKMASK(PIE9), 5, b
#define CCP4IF                           BANKMASK(PIR9), 5, b
#define CCP4IP                           BANKMASK(IPR9), 5, b
#define CCP4MD                           BANKMASK(PMD3), 3, b
#define CCP4MODE0                        BANKMASK(CCP4CON), 0, a
#define CCP4MODE1                        BANKMASK(CCP4CON), 1, a
#define CCP4MODE2                        BANKMASK(CCP4CON), 2, a
#define CCP4MODE3                        BANKMASK(CCP4CON), 3, a
#define CCP4OUT                          BANKMASK(CCP4CON), 5, a
#define CCP9E                            BANKMASK(PORTE), 3, a
#define CDAFVR0                          BANKMASK(FVRCON), 2, b
#define CDAFVR1                          BANKMASK(FVRCON), 3, b
#define CDIV0                            BANKMASK(OSCCON2), 0, b
#define CDIV1                            BANKMASK(OSCCON2), 1, b
#define CDIV2                            BANKMASK(OSCCON2), 2, b
#define CDIV3                            BANKMASK(OSCCON2), 3, b
#define CH0                              BANKMASK(MD1CARH), 0, b
#define CH1                              BANKMASK(MD1CARH), 1, b
#define CH2                              BANKMASK(MD1CARH), 2, b
#define CH3                              BANKMASK(MD1CARH), 3, b
#define CH4                              BANKMASK(MD1CARH), 4, b
#define CHPOL                            BANKMASK(MD1CON1), 5, b
#define CHSYNC                           BANKMASK(MD1CON1), 4, b
#define CKE                              BANKMASK(SPI1CON1), 6, b
#define CKP                              BANKMASK(SPI1CON1), 5, b
#define CKPS3                            BANKMASK(T0CON1), 3, a
#define CKS0                             BANKMASK(NCO1CLK), 0, b
#define CKS1                             BANKMASK(NCO1CLK), 1, b
#define CKS2                             BANKMASK(NCO1CLK), 2, b
#define CKS3                             BANKMASK(NCO1CLK), 3, b
#define CL0                              BANKMASK(MD1CARL), 0, b
#define CL1                              BANKMASK(MD1CARL), 1, b
#define CL2                              BANKMASK(MD1CARL), 2, b
#define CL3                              BANKMASK(MD1CARL), 3, b
#define CL4                              BANKMASK(MD1CARL), 4, b
#define CLC1IE                           BANKMASK(PIE4), 6, b
#define CLC1IF                           BANKMASK(PIR4), 6, b
#define CLC1IP                           BANKMASK(IPR4), 6, b
#define CLC1MD                           BANKMASK(PMD6), 1, b
#define CLC1OUT                          BANKMASK(CLCDATA0), 0, b
#define CLC2IE                           BANKMASK(PIE8), 5, b
#define CLC2IF                           BANKMASK(PIR8), 5, b
#define CLC2IP                           BANKMASK(IPR8), 5, b
#define CLC2MD                           BANKMASK(PMD6), 2, b
#define CLC2OUT                          BANKMASK(CLCDATA0), 1, b
#define CLC3IE                           BANKMASK(PIE9), 4, b
#define CLC3IF                           BANKMASK(PIR9), 4, b
#define CLC3IP                           BANKMASK(IPR9), 4, b
#define CLC3MD                           BANKMASK(PMD6), 3, b
#define CLC3OUT                          BANKMASK(CLCDATA0), 2, b
#define CLC4IE                           BANKMASK(PIE9), 6, b
#define CLC4IF                           BANKMASK(PIR9), 6, b
#define CLC4IP                           BANKMASK(IPR9), 6, b
#define CLC4MD                           BANKMASK(PMD6), 4, b
#define CLC4OUT                          BANKMASK(CLCDATA0), 3, b
#define CLKRCLK0                         BANKMASK(CLKRCLK), 0, b
#define CLKRCLK1                         BANKMASK(CLKRCLK), 1, b
#define CLKRCLK2                         BANKMASK(CLKRCLK), 2, b
#define CLKRCLK3                         BANKMASK(CLKRCLK), 3, b
#define CLKRDC0                          BANKMASK(CLKRCON), 3, b
#define CLKRDC1                          BANKMASK(CLKRCON), 4, b
#define CLKRDIV0                         BANKMASK(CLKRCON), 0, b
#define CLKRDIV1                         BANKMASK(CLKRCON), 1, b
#define CLKRDIV2                         BANKMASK(CLKRCON), 2, b
#define CLKREN                           BANKMASK(CLKRCON), 7, b
#define CLKRMD                           BANKMASK(PMD0), 1, b
#define CLKSEL                           BANKMASK(CIOCON), 0, b
#define CLKSEL0                          BANKMASK(SPI1CLK), 0, b
#define CLKSEL1                          BANKMASK(SPI1CLK), 1, b
#define CLKSEL2                          BANKMASK(SPI1CLK), 2, b
#define CLPOL                            BANKMASK(MD1CON1), 1, b
#define CLSYNC                           BANKMASK(MD1CON1), 0, b
#define CMIE                             BANKMASK(PIE2), 6, b
#define CMIF                             BANKMASK(PIR2), 6, b
#define CMIP                             BANKMASK(IPR2), 6, b
#define CMP1MD                           BANKMASK(PMD2), 1, b
#define CMP2MD                           BANKMASK(PMD2), 2, b
#define CNT1IE                           BANKMASK(I2C1PIE), 7, b
#define CNT1IF                           BANKMASK(I2C1PIR), 7, b
#define CNT2IE                           BANKMASK(I2C2PIE), 7, b
#define CNT2IF                           BANKMASK(I2C2PIR), 7, b
#define CONT                             BANKMASK(ADCON0), 6, b
#define COSC0                            BANKMASK(OSCCON2), 4, b
#define COSC1                            BANKMASK(OSCCON2), 5, b
#define COSC2                            BANKMASK(OSCCON2), 6, b
#define CPON                             BANKMASK(ADCP), 7, b
#define CPRDY                            BANKMASK(ADCP), 0, b
#define CRCEN                            BANKMASK(CRCCON0), 7, b
#define CRCGO                            BANKMASK(CRCCON0), 6, b
#define CRCIE                            BANKMASK(PIE0), 6, b
#define CRCIF                            BANKMASK(PIR0), 6, b
#define CRCIP                            BANKMASK(IPR0), 6, b
#define CRCMD                            BANKMASK(PMD0), 4, b
#define CRS0                             BANKMASK(ADCON2), 4, b
#define CRS1                             BANKMASK(ADCON2), 5, b
#define CRS2                             BANKMASK(ADCON2), 6, b
#define CS5                              BANKMASK(ADCLK), 5, b
#define CSWHOLD                          BANKMASK(OSCCON3), 7, b
#define CSWIE                            BANKMASK(PIE0), 3, b
#define CSWIF                            BANKMASK(PIR0), 3, b
#define CSWIP                            BANKMASK(IPR0), 3, b
#define CWG1CS                           BANKMASK(CWG1CLK), 0, b
#define CWG1DBF0                         BANKMASK(CWG1DBF), 0, b
#define CWG1DBF1                         BANKMASK(CWG1DBF), 1, b
#define CWG1DBF2                         BANKMASK(CWG1DBF), 2, b
#define CWG1DBF3                         BANKMASK(CWG1DBF), 3, b
#define CWG1DBF4                         BANKMASK(CWG1DBF), 4, b
#define CWG1DBF5                         BANKMASK(CWG1DBF), 5, b
#define CWG1DBR0                         BANKMASK(CWG1DBR), 0, b
#define CWG1DBR1                         BANKMASK(CWG1DBR), 1, b
#define CWG1DBR2                         BANKMASK(CWG1DBR), 2, b
#define CWG1DBR3                         BANKMASK(CWG1DBR), 3, b
#define CWG1DBR4                         BANKMASK(CWG1DBR), 4, b
#define CWG1DBR5                         BANKMASK(CWG1DBR), 5, b
#define CWG1EN                           BANKMASK(CWG1CON0), 7, b
#define CWG1IE                           BANKMASK(PIE4), 5, b
#define CWG1IF                           BANKMASK(PIR4), 5, b
#define CWG1IN                           BANKMASK(CWG1CON1), 5, b
#define CWG1IP                           BANKMASK(IPR4), 5, b
#define CWG1ISM0                         BANKMASK(CWG1ISM), 0, b
#define CWG1ISM1                         BANKMASK(CWG1ISM), 1, b
#define CWG1ISM2                         BANKMASK(CWG1ISM), 2, b
#define CWG1ISM3                         BANKMASK(CWG1ISM), 3, b
#define CWG1LD                           BANKMASK(CWG1CON0), 6, b
#define CWG1LSAC0                        BANKMASK(CWG1AS0), 2, b
#define CWG1LSAC1                        BANKMASK(CWG1AS0), 3, b
#define CWG1LSBD0                        BANKMASK(CWG1AS0), 4, b
#define CWG1LSBD1                        BANKMASK(CWG1AS0), 5, b
#define CWG1MD                           BANKMASK(PMD4), 5, b
#define CWG1MODE0                        BANKMASK(CWG1CON0), 0, b
#define CWG1MODE1                        BANKMASK(CWG1CON0), 1, b
#define CWG1MODE2                        BANKMASK(CWG1CON0), 2, b
#define CWG1OVRA                         BANKMASK(CWG1STR), 4, b
#define CWG1OVRB                         BANKMASK(CWG1STR), 5, b
#define CWG1OVRC                         BANKMASK(CWG1STR), 6, b
#define CWG1OVRD                         BANKMASK(CWG1STR), 7, b
#define CWG1POLA                         BANKMASK(CWG1CON1), 0, b
#define CWG1POLB                         BANKMASK(CWG1CON1), 1, b
#define CWG1POLC                         BANKMASK(CWG1CON1), 2, b
#define CWG1POLD                         BANKMASK(CWG1CON1), 3, b
#define CWG1REN                          BANKMASK(CWG1AS0), 6, b
#define CWG1SHUTDOWN                     BANKMASK(CWG1AS0), 7, b
#define CWG1STRA                         BANKMASK(CWG1STR), 0, b
#define CWG1STRB                         BANKMASK(CWG1STR), 1, b
#define CWG1STRC                         BANKMASK(CWG1STR), 2, b
#define CWG1STRD                         BANKMASK(CWG1STR), 3, b
#define CWG2CS                           BANKMASK(CWG2CLK), 0, b
#define CWG2DBF0                         BANKMASK(CWG2DBF), 0, b
#define CWG2DBF1                         BANKMASK(CWG2DBF), 1, b
#define CWG2DBF2                         BANKMASK(CWG2DBF), 2, b
#define CWG2DBF3                         BANKMASK(CWG2DBF), 3, b
#define CWG2DBF4                         BANKMASK(CWG2DBF), 4, b
#define CWG2DBF5                         BANKMASK(CWG2DBF), 5, b
#define CWG2DBR0                         BANKMASK(CWG2DBR), 0, b
#define CWG2DBR1                         BANKMASK(CWG2DBR), 1, b
#define CWG2DBR2                         BANKMASK(CWG2DBR), 2, b
#define CWG2DBR3                         BANKMASK(CWG2DBR), 3, b
#define CWG2DBR4                         BANKMASK(CWG2DBR), 4, b
#define CWG2DBR5                         BANKMASK(CWG2DBR), 5, b
#define CWG2EN                           BANKMASK(CWG2CON0), 7, b
#define CWG2IE                           BANKMASK(PIE8), 4, b
#define CWG2IF                           BANKMASK(PIR8), 4, b
#define CWG2IN                           BANKMASK(CWG2CON1), 5, b
#define CWG2IP                           BANKMASK(IPR8), 4, b
#define CWG2ISM0                         BANKMASK(CWG2ISM), 0, b
#define CWG2ISM1                         BANKMASK(CWG2ISM), 1, b
#define CWG2ISM2                         BANKMASK(CWG2ISM), 2, b
#define CWG2ISM3                         BANKMASK(CWG2ISM), 3, b
#define CWG2LD                           BANKMASK(CWG2CON0), 6, b
#define CWG2LSAC0                        BANKMASK(CWG2AS0), 2, b
#define CWG2LSAC1                        BANKMASK(CWG2AS0), 3, b
#define CWG2LSBD0                        BANKMASK(CWG2AS0), 4, b
#define CWG2LSBD1                        BANKMASK(CWG2AS0), 5, b
#define CWG2MD                           BANKMASK(PMD4), 6, b
#define CWG2MODE0                        BANKMASK(CWG2CON0), 0, b
#define CWG2MODE1                        BANKMASK(CWG2CON0), 1, b
#define CWG2MODE2                        BANKMASK(CWG2CON0), 2, b
#define CWG2OVRA                         BANKMASK(CWG2STR), 4, b
#define CWG2OVRB                         BANKMASK(CWG2STR), 5, b
#define CWG2OVRC                         BANKMASK(CWG2STR), 6, b
#define CWG2OVRD                         BANKMASK(CWG2STR), 7, b
#define CWG2POLA                         BANKMASK(CWG2CON1), 0, b
#define CWG2POLB                         BANKMASK(CWG2CON1), 1, b
#define CWG2POLC                         BANKMASK(CWG2CON1), 2, b
#define CWG2POLD                         BANKMASK(CWG2CON1), 3, b
#define CWG2REN                          BANKMASK(CWG2AS0), 6, b
#define CWG2SHUTDOWN                     BANKMASK(CWG2AS0), 7, b
#define CWG2STRA                         BANKMASK(CWG2STR), 0, b
#define CWG2STRB                         BANKMASK(CWG2STR), 1, b
#define CWG2STRC                         BANKMASK(CWG2STR), 2, b
